[
  {
    "id": "CAT-MIP-08072025-000000010",
    "canonical_term": "Access Point",
    "definition": "An Access Point is a network device that allows wireless-capable devices to connect to a wired network using Wi-Fi or other wireless standards. It acts as a bridge between wireless clients and the wired infrastructure, managing traffic, authentication, and radio frequency (RF) coverage. In MSP and IT environments, access points are centrally monitored and managed to ensure reliable wireless connectivity, performance, and security.",
    "synonyms": [
      "Wireless Access Point",
      "Wi-Fi AP",
      "AP",
      "Wireless Controller (context-specific)",
      "Hotspot (informal or public context)",
      "Access Point serves Wireless Client or Endpoint",
      "Access Point broadcasts SSID and enforces Wireless Policy",
      "Locate the access point in the inventory or network topology",
      "Retrieve and report configuration, client associations, and health metrics",
      "Apply changes such as SSID updates, channel adjustments, or firmware upgrades",
      "Log all actions related to access point configuration and status for auditing"
    ],
    "relationships": [
      "Access Point isConnectedTo Switch or Router",
      "Access Point isManagedBy Controller, Agent, or Cloud Console",
      "Access Point isMonitoredFor Signal Strength, Client Load, or Interference",
      "Monitor real-time performance and connectivity issues"
    ],
    "prompt_examples": [
      "List all access points at the Denver office and their client count.",
      "Restart the rooftop access point remotely due to packet loss reports.",
      "Which access points are using outdated firmware?",
      "Configure SSID and VLAN tagging on all indoor access points."
    ],
    "agent_execution": {
      "interpretation": "When a prompt refers to an “Access Point,” the AI agent will:",
      "actions": []
    },
    "metadata": {
      "author": "Roop Petersen",
      "source_url": "",
      "version": "1.0", 
      "date_added": "2025-08-07T00:00:00Z",
      "registry": "cat-mip.org",
      "term_type": ""
    }
  },
 {
  "id": "CAT-MIP-08072025-000000011",
  "canonical_term": "Account",
  "definition": "The term Account is discouraged due to its ambiguity. It can refer to multiple different roles in the N-able ecosystem, including: a Tenant (a customer managed by an MSP), an MSP (a partner of N-able), a Distributor Customer (a client of a distributor), or a Billing Entity (used in financial systems). Because of this ambiguity, using 'Account' in prompts or documentation can cause confusion or incorrect agent actions.",
  "synonyms": [
    "Account (ambiguous – avoid)",
    "Client (ambiguous – avoid unless scoped)",
    "Partner (ambiguous – clarify as MSP or Distributor)"
  ],
  "relationships": [
    "Tenant belongsTo MSP",
    "MSP isPartnerOf N-able",
    "Customer isManagedBy Distributor",
    "BillingEntity paysFor Subscription"
  ],
  "prompt_examples": [
    "INCORRECT: Get a list of all accounts with over 100 devices.",
    "CORRECT: Get a list of all tenants with over 100 devices.",
    "INCORRECT: Which accounts are overdue on patch compliance?",
    "CORRECT: Which MSPs or tenants are overdue on patch compliance?",
    "INCORRECT: Send onboarding materials to new accounts.",
    "CORRECT: Send onboarding materials to new MSPs and distributors."
  ],
  "agent_execution": {
    "interpretation": "When 'Account' is used in a prompt, the AI agent will:",
    "actions": [
      "Attempt to infer the intended object (Tenant, MSP, Customer, etc.)",
      "Prompt for clarification if multiple interpretations are possible",
      "If inference succeeds, resolve the term to the correct object type and execute accordingly",
      "This behavior increases the risk of misinterpretation and is not recommended"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
 {
  "id": "CAT-MIP-08072025-000000021",
  "canonical_term": "Agent",
  "definition": "An Agent is a lightweight software component installed on a managed Device (Asset) that enables remote monitoring, management, automation, and communication with N-able or integrated systems. Agents collect telemetry, enforce policies, run scripts, initiate backups, and trigger alerts based on configured logic. In the MSP context, agents are essential for endpoint visibility, proactive issue resolution, and executing AI-assisted or automated workflows.",
  "synonyms": [
    "Monitoring Agent",
    "Management Agent",
    "Endpoint Agent"
  ],
  "relationships": [
    "Agent isInstalledOn Device",
    "Agent isManagedBy Product (e.g., N-central, Cove)",
    "Agent executes Script or Task",
    "Agent reportsTo Platform or OrchestrationService",
    "Agent monitors Performance, Security, and PolicyCompliance",
    "Agent enables Action or Automation"
  ],
  "prompt_examples": [
    "Check if the N-central agent is online on device ‘HR-LT-003’.",
    "List all agents running outdated versions across the ‘Finance’ tenant.",
    "Trigger the backup task via the local agent on all Windows servers."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Agent,” the AI agent will:",
    "actions": [
      "Identify the installed agent on the specified device(s)",
      "Check health, version, and last check-in time",
      "Determine the agent’s capabilities (e.g., scripting, monitoring, backup)",
      "Initiate agent-driven tasks such as running scripts, collecting metrics, or applying policies",
      "Return results or errors from agent-initiated actions"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000031",
  "canonical_term": "AI Agent",
  "definition": "An AI Agent is a software-based autonomous entity that interprets natural language prompts and executes multistep reasoning and actions using defined tools, APIs, and structured knowledge. AI Agents in the N-able context interact with the platform, devices, users, and other systems to perform tasks such as triage, reporting, automation, or decision support. AI Agents can chain tools, call scripts, and escalate issues, often acting on behalf of a technician or service provider.",
  "synonyms": [
    "Intelligent Agent",
    "Proactive Assistant",
    "Automation Agent",
    "GenAI Agent (in LLM-driven systems)"
  ],
  "relationships": [
    "AI Agent interprets Prompt",
    "AI Agent calls Action or Tool",
    "AI Agent queries DataSource or KnowledgeBase",
    "AI Agent interactsWith User, Device, or Platform",
    "AI Agent isEnabledBy Model Context Protocol (via MCP)",
    "AI Agent produces Result or SuggestedResolution"
  ],
  "prompt_examples": [
    "AI Agent, why is device ‘ENG-LT-22’ running slowly this week?",
    "Summarize patch compliance across all tenants and suggest remediation for non-compliant devices.",
    "What backup risks exist for customers using Microsoft 365, and how should we address them?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt is directed to an AI Agent, it will:",
    "actions": [
      "Interpret the natural language request and identify intent",
      "Use structured terminology (from the MSP MCP Terminology Standard) to disambiguate terms like “asset” vs. “device”",
      "Call tools (e.g., APIs, scripts, workflows) to gather data or take action",
      "Reason over context (e.g., device health, policy violations, previous incidents)",
      "Return human-readable results or initiate further actions",
      "Optionally escalate, log, or interact with other AI Agents"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000041",
  "canonical_term": "API",
  "definition": "API (Application Programming Interface) is a defined set of protocols and methods that allows software systems to communicate with each other. APIs expose functions, data, or services that can be accessed programmatically, enabling integration, automation, and extensibility across platforms. In MSP and IT environments, APIs are used for retrieving data, triggering actions, synchronizing systems, and building custom workflows.",
  "synonyms": [
    "Application Programming Interface",
    "Web API",
    "REST API",
    "Endpoint",
    "Integration Interface"
  ],
  "relationships": [
    "API isExposedBy Platform, Application, or Service",
    "API isCalledBy Script, Agent, or External System",
    "API exposes Endpoint, Method, and Payload",
    "API isSecuredBy Token, Key, or OAuth",
    "API mayTrigger Workflow, Alert, or Data Sync"
  ],
  "prompt_examples": [
    "Call the backup API to retrieve job history for the last 7 days.",
    "Does the N-central API support device onboarding?",
    "List all third-party APIs integrated with our RMM system.",
    "Create a webhook that posts ticket updates to an external API."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “API,” the AI agent will:",
    "actions": [
      "Identify the correct API endpoint and required authentication method",
      "Format and send a request using the appropriate HTTP method (e.g., GET, POST, PUT, DELETE)",
      "Parse the response data and handle errors or exceptions",
      "Take follow-up actions based on the API response, such as updating records or triggering alerts",
      "Log the API interaction for tracking, troubleshooting, or auditing"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000051",
  "canonical_term": "Asset",
  "definition": "An Asset refers to any physical or logical entity managed by portfolio products. This includes, but is not limited to, endpoints (e.g., laptops, desktops, servers), edge systems, mobile devices, cloud resources, Entra (Azure AD) identities, and Microsoft 365 services. Assets represent the lowest-level managed object within a hierarchy. Use the canonical term Asset instead of 'Device,' which is a limited synonym. Assets can exist in various environments—on-prem, cloud, hybrid—and across tenants, sites, and service organizations.",
  "synonyms": [
    "Device",
    "Endpoint",
    "Node (legacy)",
    "Laptop (ambiguous — use only when specifically identifying form factor)"
  ],
  "relationships": [
    "Asset has Policy",
    "Asset belongsTo Tenant",
    "Asset isMonitoredBy Agent",
    "Asset runs Script",
    "Asset hasStatus HealthState",
    "Asset contains Software",
    "Asset has RiskScore"
  ],
  "prompt_examples": [
    "Reboot the asset named ‘ENG-WORKSTATION-03’ if it’s unresponsive.",
    "What’s the patch compliance status of all assets in the ‘Sales’ department?",
    "Run the disk cleanup script on all Windows 10 assets with over 80% disk usage."
  ],
  "agent_execution": {
    "interpretation": "",
    "actions": []
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000061",
  "canonical_term": "Audit Log",
  "definition": "An Audit Log is a chronological record of system-generated entries that capture actions, events, or changes performed within a platform, application, or network. Each log entry typically includes a timestamp, actor (user or system), action type, and target object. Audit logs are used for accountability, traceability, compliance, security investigations, and operational transparency.",
  "synonyms": [
    "Audit Trail",
    "Activity Log",
    "Event Log (context-specific)",
    "Change Log",
    "System Log (partial overlap)"
  ],
  "relationships": [
    "Audit Log records Action performedBy User or Agent",
    "Audit Log appliesTo Object (e.g., Device, Policy, Ticket, File)",
    "Audit Log isStoredIn LogDatabase or SIEM",
    "Audit Log isQueriedFor Compliance, Forensics, or Reporting",
    "Audit Log mayTrigger Alert or Review"
  ],
  "prompt_examples": [
    "Show all audit log entries for user ‘jsmith’ in the last 30 days.",
    "Export the audit log for all policy changes made this quarter.",
    "Did any agent scripts get modified without approval?",
    "Alert if audit logs indicate repeated failed login attempts."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Audit Log,” the AI agent will:",
    "actions": [
      "Access the appropriate audit logging source (e.g., N-central, RMM, backup system)",
      "Filter entries based on actors, actions, time ranges, or object types",
      "Format relevant data for review or export",
      "Detect anomalies or compliance breaches if configured",
      "Log the audit query or access action itself, if required by policy"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000071",
  "canonical_term": "Backup",
  "definition": "A Backup is a secure, stored copy of data, system configuration, or application state, used to restore functionality or recover from data loss, corruption, or disaster. In the MSP and N-able context, backups may be scheduled, continuous, or event-triggered, and can target endpoints, servers, cloud services (e.g., Microsoft 365), or databases. Backup policies define the scope, frequency, retention, and storage destination of backup operations.",
  "synonyms": [
    "Data Backup",
    "System Image (if referring to full-machine backup)",
    "Snapshot (when describing state-based backups)",
    "Restore Point (when used for rollback)"
  ],
  "relationships": [
    "Backup isCreatedFor Device, Asset, Server, File, Database, or Service",
    "Backup isManagedBy BackupPolicy",
    "Backup isStoredIn Cove or Cloud Storage",
    "Backup isMonitoredBy Agent or Platform",
    "Backup isRestoredBy Restore Job",
    "Backup isOwnedBy Tenant or MSP"
  ],
  "prompt_examples": [
    "When was the last successful backup for the server ‘NY-SQL-01’?",
    "List all failed backup jobs in the past 48 hours across the ‘Retail’ tenant.",
    "Restore the backup of user ‘jane.doe’ mailbox from last Monday."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Backup,” the AI agent will:",
    "actions": [
      "Locate the latest or requested backup instance based on entity, time, and scope",
      "Validate its status (successful, failed, in progress)",
      "Trigger restore actions if authorized, using the appropriate recovery method",
      "Check backup compliance with configured policies (frequency, retention)",
      "Generate audit logs or reports based on backup history and status"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
 {
  "id": "CAT-MIP-08072025-000000081",
  "canonical_term": "Certificate",
  "definition": "A Certificate is a digital credential that authenticates the identity of an entity (such as a user, device, or service) and facilitates secure communication through encryption. Certificates are issued by a Certificate Authority (CA) and are integral to Public Key Infrastructure (PKI). They ensure data integrity, confidentiality, and authenticity in digital communications.",
  "synonyms": [
    "Digital Certificate",
    "SSL/TLS Certificate",
    "X.509 Certificate",
    "Public Key Certificate"
  ],
  "relationships": [
    "Certificate isIssuedBy Certificate Authority",
    "Certificate isAssignedTo Device or User",
    "Certificate isUsedFor Authentication or Encryption",
    "Certificate hasValidityPeriod StartDate and EndDate",
    "Certificate isRevokedBy Certificate Authority",
    "Certificate isStoredIn Certificate Repository"
  ],
  "prompt_examples": [
    "List all certificates expiring within the next 30 days.",
    "Check if the SSL certificate for ‘client-portal.example.com’ is valid.",
    "Revoke the compromised certificate assigned to device ‘ENG-LT-05’."
  ],
  "agent_execution": {
    "interpretation": "When a prompt includes “Certificate,” the AI agent will:",
    "actions": [
      "Identify the specific certificate(s) based on context (e.g., domain name, device ID)",
      "Retrieve certificate details such as issuer, subject, validity period, and status",
      "Perform actions like validation checks, renewal processes, or revocation procedures",
      "Update relevant systems or repositories with the current certificate status"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
 {
  "id": "CAT-MIP-08072025-000000091",
  "canonical_term": "CLI",
  "definition": "CLI (Command-Line Interface) is a text-based interface that allows users or systems to interact with software, operating systems, or devices by typing commands. The CLI provides direct access to system functions, configuration, and diagnostics without a graphical user interface. In MSP and IT environments, CLI tools are widely used for scripting, automation, remote troubleshooting, and advanced configuration.",
  "synonyms": [
    "Command Line",
    "Terminal",
    "Shell (context-specific)",
    "Console",
    "Prompt"
  ],
  "relationships": [
    "CLI isAccessedBy Technician, Script, or Remote Agent",
    "CLI executes Command or Script",
    "CLI interfacesWith OS, Application, or Network Device",
    "CLI isUsedFor Automation, Troubleshooting, or Configuration",
    "CLI mayBeLoggedIn Session History or Audit Log"
  ],
  "prompt_examples": [
    "Run a CLI command to restart the DNS service on all Linux servers.",
    "Which CLI tool is available for managing VMware hosts?",
    "Log all CLI activity performed by admin accounts.",
    "Execute the patch deployment script via CLI on endpoints missing updates."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “CLI,” the AI agent will:",
    "actions": [
      "Identify the appropriate CLI environment based on the target system (e.g., Bash, PowerShell, Command Prompt)",
      "Execute the requested command or script using available permissions",
      "Capture output, errors, and system responses",
      "Validate results and proceed with next steps if part of a workflow",
      "Log all CLI interactions for auditing, error tracking, or rollback"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000101",
  "canonical_term": "Cloud",
  "definition": "Cloud refers to infrastructure, platforms, or services hosted in a remote, internet-accessible environment rather than on-premises. In the N-able context, 'Cloud' is typically used to describe: N-able’s own cloud-native products (e.g., Cove, Cloud Commander, NC Hosted); third-party integrations with public cloud providers (e.g., AWS, Azure, GCP); and the hosting location or operational model for managed assets, policies, or storage. Because the term is broad, it should be accompanied by a qualifier (e.g., Cloud Backup, Cloud Integration, Cloud Device) to ensure clarity.",
  "synonyms": [
    "SaaS Platform (when referring to N-able-hosted tools)",
    "Hosted Environment",
    "Public Cloud (AWS, Azure, etc.)",
    "Cloud Service Provider (CSP)"
  ],
  "relationships": [
    "Cloud hosts Service or Product",
    "Cloud contains Asset or Instance",
    "Cloud isIntegratedWith N-able or ExternalVendor",
    "Cloud provides Storage or Compute",
    "Cloud runs Automation or ScheduledTask",
    "Cloud isAccessedBy Agent or User"
  ],
  "prompt_examples": [
    "INCORRECT: Is this customer in the cloud?",
    "CORRECT: Is this customer using N-able Cove Cloud Backup?",
    "INCORRECT: Scan all cloud resources for vulnerabilities.",
    "CORRECT: Scan all Azure-hosted virtual machines for vulnerabilities.",
    "CORRECT: List all devices managed through Cloud User Hub that belong to tenant ‘BlueSteel LLC’."
  ],
  "agent_execution": {
    "interpretation": "When a prompt includes “Cloud,” the AI agent will:",
    "actions": [
      "Attempt to classify the intended meaning: Is it referencing a product (e.g., Cove)? A hosting model (e.g., AWS-based device)? A data source (e.g., cloud backup logs)?",
      "Resolve actions or queries using the correct integration, platform, or cloud service context",
      "Validate scope: Is the object hosted in the cloud? Is it managed via a cloud product?",
      "Return results filtered by cloud product, provider, or hosting model"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000111",
  "canonical_term": "Credentials",
  "definition": "Credentials are a set of authentication details used to verify the identity of a user, device, or system when accessing resources, services, or data. Typically, credentials include usernames and passwords, but they may also involve tokens, API keys, certificates, or biometric factors. In MSP and IT environments, credentials are securely stored, managed, and used by agents or technicians to perform automated tasks, remote access, or integrations.",
  "synonyms": [
    "Login Information",
    "Access Credentials",
    "Authentication Details",
    "Account Info",
    "Secrets (in DevOps or automation contexts)"
  ],
  "relationships": [
    "Credentials areUsedBy Agent, Technician, or Script",
    "Credentials grantAccessTo Device, Application, or Service",
    "Credentials areStoredIn Vault, Credential Store, or Password Manager",
    "Credentials areManagedBy Policy or Role-Based Access Control",
    "Credentials mayBeRotated or Expired"
  ],
  "prompt_examples": [
    "Update the admin credentials for all SNMP-enabled switches.",
    "Which scripts currently use stored credentials for authentication?",
    "Create a new set of credentials for backup service access.",
    "Audit failed login attempts using shared credentials."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Credentials,” the AI agent will:",
    "actions": [
      "Locate the appropriate credential set based on context, role, or task",
      "Authenticate securely before executing any action that requires credentials",
      "Follow storage and access policies, including masking or redacting sensitive data in logs",
      "Trigger alerts or remediation steps if credential validation fails or is misused",
      "Record credential usage activity for auditing and compliance"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
 {
  "id": "CAT-MIP-08072025-000000121",
  "canonical_term": "Data",
  "definition": "(Use with specificity—prefer concrete terms like Log, Metric, Event, or Configuration when possible) Data refers to any structured or unstructured information collected, stored, or generated by N-able systems and integrated tools. This includes telemetry, logs, metrics, configuration records, alerts, ticket history, and external feeds. While “Data” is technically accurate, it is too broad for effective agent interaction. Prompts should specify the type of data required to ensure accurate retrieval or action.",
  "synonyms": [
    "Information (too vague – avoid)",
    "Output (context-specific – use with care)",
    "Result (use for returned data from a function or query)"
  ],
  "relationships": [
    "Data isGeneratedBy N-able, MSP, Device, Script, or Integration",
    "Data isStoredIn Repository or Platform",
    "Data isConsumedBy Agent or Automation or Policy",
    "Data isTaggedWith Type (e.g., metric, alert, configuration)",
    "Data belongsTo N-able or MSP or Tenant or Site"
  ],
  "prompt_examples": [
    "INCORRECT: Get all data for this tenant.",
    "CORRECT: Get performance metrics and alert logs for this tenant.",
    "INCORRECT: Analyze the data for policy violations.",
    "CORRECT: Analyze event logs and compliance reports for policy violations.",
    "CORRECT: Retrieve CPU and memory usage data for device ‘ENG-LT-05’ for the past 7 days."
  ],
  "agent_execution": {
    "interpretation": "When “Data” is used in a prompt, the AI agent will:",
    "actions": [
      "Attempt to infer the correct data type based on additional context (e.g., time range, source, object)",
      "Search available data sources (e.g., telemetry, logs, monitoring tools)",
      "Return multiple types if ambiguity remains, or issue a request for clarification",
      "Default to commonly accessed types (e.g., metrics and logs) if unspecified"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000131",
  "canonical_term": "Disk",
  "definition": "A Disk is a physical or virtual storage component used by a device to persist data. Disks can be hard drives (HDD), solid-state drives (SSD), or virtual volumes (e.g., VHDs in cloud environments). In the N-able context, disk information is collected for monitoring storage capacity, performance, health, and lifecycle. Disks may be local (installed on a device) or network-attached, and are critical for system stability and application functionality.",
  "synonyms": [
    "Drive",
    "Storage Device",
    "Volume (when partitioned or virtualized)",
    "HDD / SSD (specific types of disks)"
  ],
  "relationships": [
    "Disk isPartOf Device",
    "Disk hasCapacity Size",
    "Disk hasUsedSpace / FreeSpace",
    "Disk hasHealthStatus",
    "Disk isMonitoredBy Agent",
    "Disk stores File or Software"
  ],
  "prompt_examples": [
    "Check disk usage on all servers in the ‘Legal’ tenant.",
    "Alert me when any disk has less than 10% free space.",
    "List all devices with SSDs larger than 512GB."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Disk,” the AI agent will:",
    "actions": [
      "Retrieve storage information from device telemetry or system APIs",
      "Report on total capacity, free space, used percentage, and disk type",
      "Monitor for thresholds (e.g., low space, high I/O wait times)",
      "Trigger alerts or automated cleanup scripts as needed",
      "Differentiate between physical disks and logical partitions/volumes"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
  {
  "id": "CAT-MIP-08072025-000000141",
  "canonical_term": "Distributor",
  "definition": "A Distributor is an organization authorized by N-able to resell N-able products and services. Distributors may operate under their own branding, manage multiple MSPs or sub-distributors, and may either directly support their downstream entities or rely on N-able for support. Distributors typically have visibility and limited control over the environments of their managed MSPs.",
  "synonyms": [
    "Partner (ambiguous – avoid unless context is clear)",
    "Channel Partner",
    "Aggregator (in legacy or specific sales contexts)",
    "Reseller (not exact. do not use. Resellers do not typically support products or access interfaces)"
  ],
  "relationships": [
    "Distributor resells Product",
    "Distributor supports MSP",
    "Distributor manages SubDistributor",
    "Distributor has Visibility into Tenant",
    "Distributor follows PolicyTemplate from N-able",
    "Distributor isManagedBy N-able"
  ],
  "prompt_examples": [
    "List all MSPs under the distributor ‘AlphaTech’.",
    "Does the distributor ‘EuroSecure’ manage support for its MSPs or is it handled by N-able?",
    "Deploy the onboarding script to all new tenants under the distributor ‘CloudBridge’."
  ],
  "agent_execution": {
    "interpretation": "When the term “Distributor” is used, the agent interprets the request as applying to an intermediary layer between N-able and one or more MSPs. The agent will:",
    "actions": [
      "Query the organizational hierarchy to identify associated MSPs or tenants",
      "Check configuration settings to determine whether the Distributor or N-able owns support responsibilities",
      "Determine available product sets, policies, or automation workflows that the Distributor can access or propagate",
      "Restrict or allow actions based on permissions assigned at the Distributor level"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000151",
  "canonical_term": "Endpoint",
  "definition": "An Endpoint is any device that connects to a network and communicates with other systems, services, or users. Common endpoints include laptops, desktops, servers, mobile devices, and virtual machines. In MSP and IT environments, endpoints are managed assets that may be monitored, secured, patched, and inventoried. Endpoints are often the target of policies, automation, alerts, and security controls.",
  "synonyms": [
    "Device",
    "Client Device",
    "Managed Asset",
    "Workstation (context-specific)",
    "Node (in network or monitoring contexts)"
  ],
  "relationships": [
    "Endpoint isMonitoredBy Agent or Probe",
    "Endpoint isPartOf Site, Network, or Tenant",
    "Endpoint receives Policy, Update, or Script",
    "Endpoint isTrackedIn Inventory or CMDB",
    "Endpoint mayGenerate Alert or Ticket"
  ],
  "prompt_examples": [
    "List all endpoints that haven’t checked in within the last 48 hours.",
    "Deploy the antivirus policy to all unmanaged endpoints.",
    "Which endpoints have BitLocker encryption enabled?",
    "Group endpoints by OS version and patch status."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Endpoint,” the AI agent will:",
    "actions": [
      "Identify the device using inventory or monitoring data",
      "Retrieve endpoint-specific attributes such as hostname, IP address, OS, status, and last check-in time",
      "Apply relevant policies, automations, or scripts as requested",
      "Trigger monitoring actions or escalate issues based on endpoint health or configuration",
      "Record any actions taken in the system log or ticketing platform"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000161",
  "canonical_term": "ExternalVendor",
  "definition": "An External Vendor is a third-party company that provides software, hardware, or services which integrate with N-able products. These vendors are typically integration partners and may offer functionality in areas such as security, backup, PSA (Professional Services Automation), billing, remote access, or threat detection. External Vendors participate in the N-able ecosystem by exposing APIs, actions, or event streams that can be called by or respond to AI Agents, scripts, and workflows.",
  "synonyms": [
    "Vendor",
    "Integration Partner",
    "Third-Party Provider",
    "Tool Vendor (context-specific)"
  ],
  "relationships": [
    "ExternalVendor provides Integration",
    "ExternalVendor owns ExternalSystem",
    "ExternalVendor supports Action",
    "ExternalVendor mayBeCertifiedBy N-able",
    "ExternalVendor collaboratesWith MSP",
    "ExternalVendor integratesWith Product"
  ],
  "prompt_examples": [
    "What actions are available from the external vendor ‘SentinelOne’ through its integration?",
    "Is the external vendor ‘Acronis’ certified for cloud backup integrations with Cove?",
    "Which external vendors support remediation workflows via API?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt includes the name of an External Vendor, the agent will:",
    "actions": [
      "Search the N-able Integration Registry for known vendors",
      "Retrieve associated integrations, available actions, and certified products",
      "Determine integration status (enabled, not installed, in error) for the current MSP or Tenant",
      "Route API calls or automation flows to the appropriate external system, respecting authentication and permission boundaries",
      "Return actionable metadata such as supported event types, playbooks, or remediation capabilities"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000171",
  "canonical_term": "Firewall",
  "definition": "A Firewall is a security system—either hardware-based, software-based, or a combination of both—that monitors and controls incoming and outgoing network traffic based on predetermined security rules. It serves as a barrier between trusted internal networks and untrusted external networks, such as the internet, to prevent unauthorized access and threats. In the DevOps Infrastructure Ontology, a firewall is categorized under network infrastructure components, emphasizing its role in network security management.",
  "synonyms": [
    "Network Firewall",
    "Security Gateway",
    "Packet Filter",
    "Application Firewall"
  ],
  "relationships": [
    "Firewall controlsAccessTo NetworkSegment",
    "Firewall isDeployedOn Device",
    "Firewall hasRuleSet AccessControlList",
    "Firewall monitorsTrafficFor Threat",
    "Firewall isManagedBy SecurityPolicy",
    "Firewall logsEventsTo MonitoringSystem"
  ],
  "prompt_examples": [
    "List all firewalls deployed across the ‘Finance’ tenant’s network.",
    "Check the current rule set configured on the firewall protecting the ‘NYC-DataCenter’.",
    "Identify any unauthorized access attempts blocked by the firewall in the last 24 hours."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Firewall,” the AI agent will:",
    "actions": [
      "Identify the specific firewall instance(s) based on the context provided (e.g., tenant, location, device)",
      "Retrieve and analyze the firewall’s configuration, including rule sets and access control lists",
      "Monitor and report on traffic patterns, highlighting any anomalies or blocked access attempts",
      "Suggest or implement updates to firewall rules in response to detected threats or policy changes, if authorized"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000181",
  "canonical_term": "File",
  "definition": "A File is a discrete unit of digital data stored on a device or in the cloud. Files can represent executables, documents, logs, scripts, configurations, or any other form of structured or unstructured content. In the N-able context, files may be transferred, monitored, scanned for threats, or used as part of automation workflows. Files exist within file systems, storage volumes, or cloud containers, and may be associated with software, devices, or users.",
  "synonyms": [
    "Document (when referring to user-generated content)",
    "Artifact (in deployment or CI/CD contexts)",
    "Payload (in scripting or integration contexts)",
    "Object (in cloud storage – clarify when used)"
  ],
  "relationships": [
    "File isStoredOn Device or CloudStorage",
    "File isScannedBy AVEngine or SecurityTool",
    "File isGeneratedBy Script or Application",
    "File isModifiedBy User or Agent",
    "File isTaggedWith Label or Policy",
    "File isMonitoredBy Agent"
  ],
  "prompt_examples": [
    "Scan all executable files on server ‘NY-EX01’ for known threats.",
    "Upload the installation file to the shared repository and notify the admin.",
    "Retrieve the most recent log file from the device ‘ENG-LT-05’."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “File,” the AI agent will:",
    "actions": [
      "Resolve the file location (e.g., local device, cloud share, log directory)",
      "Perform the specified action (e.g., retrieve, scan, delete, move, check integrity)",
      "Use file metadata such as name, type, size, timestamp, and hash to identify the target",
      "Log actions and validate policy or security rules (e.g., blocking executable uploads in restricted environments)"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000191",
  "canonical_term": "Hardware",
  "definition": "Hardware refers to the physical components of an IT environment, including servers, laptops, desktops, networking gear, storage devices, and peripherals. In the N-able context, hardware is typically associated with managed Devices, and its properties (e.g., CPU type, RAM, disk size, serial number) are collected for inventory, health monitoring, and compliance tracking. Hardware may also include embedded systems and edge devices under MSP management.",
  "synonyms": [
    "Physical Asset",
    "Equipment",
    "Machine (context-specific – avoid)",
    "Host (when referring to physical servers)"
  ],
  "relationships": [
    "Hardware isPartOf Device",
    "Hardware hasComponent CPU, Memory, Disk, NIC, etc.",
    "Hardware isLocatedAt Site",
    "Hardware isMonitoredBy Agent",
    "Hardware hasWarrantyStatus or LifecycleStage",
    "Hardware supports Software"
  ],
  "prompt_examples": [
    "List all hardware with less than 8GB RAM across the ‘Education’ tenant.",
    "What hardware components are failing on server ‘NY-DC-001’?",
    "Generate a hardware inventory report for all remote offices."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Hardware,” the AI agent will:",
    "actions": [
      "Query the device inventory or telemetry sources to extract physical specs",
      "Identify hardware failures, warnings, or threshold violations",
      "Associate the hardware with the parent device and customer context",
      "Report lifecycle status (e.g., warranty expired, asset due for replacement)",
      "Trigger alerts or automations if hardware is underperforming or failing"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000201",
  "canonical_term": "Integration",
  "definition": "An Integration is a defined connection between an external vendor’s product or service and one or more N-able products. Integrations allow data exchange, automation, event handling, and workflow coordination across systems. They may be developed by N-able, by the external vendor, or by a partner, and can vary in complexity from simple scripts and API calls to deeply embedded multi-function toolsets.",
  "synonyms": [
    "Plugin (legacy or context-specific)",
    "Extension",
    "Integration Module"
  ],
  "relationships": [
    "Integration connects External Vendor to Product",
    "Integration exposes Action",
    "Integration calls N-able Action",
    "Integration consumes Data or Event from External Vendor",
    "Integration mayBeManagedBy N-able | Vendor | Partner"
  ],
  "prompt_examples": [
    "What integrations are available for ticketing systems like Autotask and ConnectWise?",
    "Enable the Bitdefender integration for all MSPs under ‘Global IT Solutions’.",
    "Does the SentinelOne integration support triggering remediation actions from within N-central?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Integration,” the agent will:",
    "actions": [
      "Identify the integration metadata from the N-able Integration Catalog",
      "Resolve the associated products, available actions, and required permissions",
      "Determine whether the integration is installed, active, or requires onboarding",
      "Enable or invoke integration-specific functionality, such as data syncs, policy mappings, or scripted triggers",
      "Route follow-up actions to the proper toolset (e.g., PSA ticketing, security alert feed, reporting system)"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08072025-000000211",
  "canonical_term": "Inventory",
  "definition": "Inventory refers to the complete, current list of assets such as devices, software, licenses, or users that are tracked and managed. Inventory systems typically collect metadata like status, version, location, ownership, and lifecycle state. Accurate inventory enables visibility, reporting, compliance, capacity planning, and automation.",
  "synonyms": [
    "Asset Inventory",
    "IT Inventory",
    "Resource List",
    "Configuration Inventory (context-specific)",
    "Inventory Database"
  ],
  "relationships": [
    "Inventory contains Device, Software, License, or User",
    "Inventory isMaintainedBy Discovery, Agent, or ManualEntry",
    "Inventory isQueriedBy AI Agent, Technician, or Policy",
    "Inventory feeds CMDB or Asset Management Platform",
    "Inventory isUsedFor Reporting, Compliance, or Automation"
  ],
  "prompt_examples": [
    "List all Windows 11 devices in the inventory with less than 8 GB of RAM.",
    "When was the last time inventory was updated for the Chicago site?",
    "Export the full software inventory for client ‘GreenByte Solutions’.",
    "Identify unlicensed software in the current inventory."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Inventory,” the AI agent will:",
    "actions": [
      "Query the relevant inventory system or asset database",
      "Filter or sort based on asset type, attributes, or compliance rules",
      "Identify gaps such as unmanaged devices or expired licenses",
      "Generate summaries, reports, or trigger remediation workflows",
      "Record any actions taken or inventory queries in the system log"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000221",
  "canonical_term": "IP Address",
  "definition": "An IP Address is a unique numerical identifier assigned to a device or interface within a network, facilitating communication between devices. IP addresses can be either IPv4 or IPv6 and are essential for routing data packets across networks. In the DevOps Infrastructure Ontology, an IP address is considered a fundamental component of network infrastructure, associated with devices, services, and network segments.",
  "synonyms": [
    "IP",
    "Internet Protocol Address",
    "Network Address (context-specific)",
    "Host Address (when referring to device-specific IPs)"
  ],
  "relationships": [
    "IP Address isAssignedTo Device or NetworkInterface",
    "IP Address belongsTo IPNetwork",
    "IP Address isUsedBy Service or Application",
    "IP Address isManagedBy NetworkManagementSystem",
    "IP Address hasType (e.g., Public, Private, Static, Dynamic)"
  ],
  "prompt_examples": [
    "List all IP addresses assigned to the ‘Finance’ department’s servers.",
    "Check if the IP address 192.168.1.10 is currently active on the network.",
    "Identify any duplicate IP addresses within the ‘NYC Office’ subnet."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “IP Address,” the AI agent will:",
    "actions": [
      "Retrieve the IP address details, including assignment, status, and associated device or service.",
      "Determine the network segment or subnet the IP address belongs to.",
      "Check for conflicts, such as duplicate assignments or unauthorized usage.",
      "Provide recommendations or actions, such as releasing, reassigning, or monitoring the IP address."
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000231",
  "canonical_term": "License",
  "definition": "A License is a contractual or system-enforced right to use a product, service, or feature within defined terms (e.g., time, scope, seats, capabilities). In the MSP and N-able context, licenses are required for using specific N-able products (e.g., N-central, Cove) or features (e.g., Take Control, advanced reporting). Licenses may apply at the tenant, device, or user level and are tracked to ensure compliance, billing accuracy, and feature access.",
  "synonyms": [
    "Subscription (context-dependent — more common in SaaS)",
    "Entitlement",
    "Access Token (avoid unless referring to security/auth)",
    "Usage Right"
  ],
  "relationships": [
    "License appliesTo Product, Feature, or Service",
    "License isOwnedBy Tenant, MSP, or Distributor",
    "License isEnforcedBy Platform or BillingSystem",
    "License isConsumedBy Device or User",
    "License hasValidityPeriod StartDate–EndDate",
    "License isTrackedIn UsageReport or BillingRecord"
  ],
  "prompt_examples": [
    "List all licenses assigned to tenant ‘SecureNet IT’.",
    "Which devices are consuming Take Control licenses?",
    "Alert me when a license is nearing expiration or usage threshold."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “License,” the AI agent will:",
    "actions": [
      "Look up the license object and its associated terms (type, scope, duration, limits)",
      "Match usage (devices, users, features) to license consumption",
      "Report on current usage, available seats, or overages",
      "Trigger notifications for nearing capacity, expiration, or violations",
      "Enforce policy: enable/disable features based on license state"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000241",
  "canonical_term": "Lifecycle",
  "definition": "A Lifecycle is the end-to-end sequence of stages that an asset, service, user, or process goes through—from creation or onboarding to retirement or decommissioning. Lifecycles help MSPs and IT professionals define, automate, and govern the expected progression of objects such as devices, tickets, users, backups, or software. Lifecycle stages typically include onboarding, active use, maintenance, and offboarding, with associated policies and triggers at each step.",
  "synonyms": [
    "Life Cycle (alternate spelling)",
    "Lifecycle State",
    "Operational Lifecycle",
    "Asset Lifecycle",
    "Service Lifecycle"
  ],
  "relationships": [
    "Lifecycle appliesTo Device, User, Ticket, Service, or Backup",
    "Lifecycle isManagedBy Policy or Automation",
    "Lifecycle includesStage Onboarding, Active, Suspended, Retired",
    "Lifecycle isTrackedIn CMDB or AssetInventory",
    "Lifecycle transitionsTrigger Alert, Action, or Notification"
  ],
  "prompt_examples": [
    "What is the current lifecycle stage of all laptops deployed last quarter?",
    "Trigger offboarding automation when a user’s lifecycle status changes to ‘terminated’.",
    "Display all assets in the ‘End-of-Life’ stage.",
    "Automatically archive tickets once they reach the ‘Closed’ lifecycle stage for 90 days."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Lifecycle,” the AI agent will:",
    "actions": [
      "Identify the object type and its current lifecycle stage",
      "Retrieve associated policies, rules, or automations linked to that stage",
      "Determine if any transitions (e.g., from Active to Retired) are pending or triggered",
      "Execute applicable workflows (e.g., provisioning, patching, decommissioning)",
      "Log the lifecycle state and any related actions in the appropriate system (e.g., CMDB, Ticketing Platform)"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000251",
  "canonical_term": "Location",
  "definition": "Location refers to the physical or geographic place associated with an asset, user, or organization. It can represent where a Device is physically deployed, where a User typically operates, or where a Site is situated. While similar to a Site, “Location” focuses strictly on geography (e.g., city, region, country, GPS), whereas Site can be a logical grouping. Location data is useful for geofencing, compliance, asset tracking, threat analysis, and assigning regional policies.",
  "synonyms": [
    "Geo (informal)",
    "Physical Address",
    "Office Location",
    "Region (when scoped to country-level or zones)",
    "Area (context-dependent — avoid unless defined)"
  ],
  "relationships": [
    "Device isLocatedAt Location",
    "Site isLocatedAt Location",
    "User operatesFrom Location",
    "Location belongsTo Tenant",
    "Location mayHave RiskProfile or ComplianceZone",
    "Location influences PolicyScope"
  ],
  "prompt_examples": [
    "List all devices currently located in Germany.",
    "Apply the EU compliance policy to locations within the EMEA region.",
    "Which locations show unusual login activity after business hours?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Location,” the agent will:",
    "actions": [
      "Resolve the geographic identifier (e.g., country, city, GPS tag, custom label)",
      "Filter relevant entities (devices, users, sites) assigned to or operating from that location",
      "Consider location-aware policies (e.g., regional compliance rules, threat intelligence mappings)",
      "Enable geolocation-sensitive workflows, alerts, or risk analysis",
      "Return context-specific responses, such as compliance status, threat levels, or regional usage trends"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000261",
  "canonical_term": "MAC Address",
  "definition": "A MAC Address (Media Access Control Address) is a unique hardware identifier assigned to a network interface card (NIC) used for communication on a local network segment. It is typically represented as a 12-digit hexadecimal value separated by colons or dashes (e.g., 00:1A:2B:3C:4D:5E). In MSP and IT operations, MAC addresses are used for device identification, inventory tracking, access control, and network diagnostics.",
  "synonyms": [
    "Physical Address",
    "Hardware Address",
    "NIC Address",
    "Ethernet Address",
    "Layer 2 Address"
  ],
  "relationships": [
    "MAC Address isAssignedTo NetworkInterface or Device",
    "MAC Address identifies Endpoint on LocalNetwork",
    "MAC Address isCollectedBy Discovery Tool or Agent",
    "MAC Address isUsedIn DHCP Reservations and Access Policies",
    "MAC Address mayBeMappedTo IP Address or Hostname"
  ],
  "prompt_examples": [
    "Find the device with MAC address 00:1C:B3:09:85:15 on the network map.",
    "List all MAC addresses associated with managed endpoints at the Austin site.",
    "Block devices not recognized by MAC address in the guest network.",
    "Export a list of MAC addresses and IPs for all online printers."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “MAC Address,” the AI agent will:",
    "actions": [
      "Search the device inventory, network discovery data, or ARP tables",
      "Match MAC addresses to known endpoints, vendors, or IP addresses",
      "Take action such as tagging, isolating, or blocking a device based on MAC identification",
      "Provide detailed reports or summaries including MAC-to-IP mapping",
      "Log any actions involving MAC-based identification or control"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000271",
  "canonical_term": "MSP",
  "definition": "An MSP (Managed Service Provider) is a type of Partner responsible for delivering IT services to one or more customer environments (tenants). MSPs use N-able products to monitor, manage, secure, and automate infrastructure for their clients. They typically own the relationship with the end customer, administer devices, apply policies, run scripts, and handle service tickets.",
  "synonyms": [
    "Partner (when the context is service delivery)",
    "Service Provider",
    "IT Provider",
    "Admin Organization (rare/legacy — avoid)"
  ],
  "relationships": [
    "MSP manages Tenant",
    "MSP owns Asset | Device",
    "MSP applies Policy",
    "MSP runs Script",
    "MSP isProvisionedBy Distributor or N-able",
    "MSP isSupportedBy N-able or Distributor",
    "MSP provides Service to End Customer",
    "MSP has AccessControl for Agent"
  ],
  "prompt_examples": [
    "List all tenants managed by the MSP ‘BrightNet Solutions’.",
    "Check for outdated antivirus software across all MSPs in the Western region.",
    "What scripts are frequently used by the MSP ‘DataSecure’ during onboarding?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an MSP, the agent identifies a Partner entity that actively delivers services to customer tenants. The agent will:",
    "actions": [
      "Resolve the MSP’s list of managed Tenants",
      "Access the MSP’s configuration (e.g., available scripts, policies, tools)",
      "Determine which Devices, Agents, and Users fall under the MSP’s control",
      "Execute actions or retrieve data within the scope of that MSP’s environment only",
      "Respect role-based access boundaries for visibility, control, and policy enforcement"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000281",
  "canonical_term": "N-able",
  "definition": "The top-level platform node representing N-able as the vendor and service provider. This is a unique, singular entity in the model. It serves as the source of platform-wide policies, agent frameworks, product definitions, and integration standards. All tenants, services, and tools exist beneath or are associated with this node.",
  "synonyms": [
    "Platform",
    "Vendor",
    "Parent org (avoid — use N-able)",
    "Global provider (context-dependent)"
  ],
  "relationships": [
    "N-able provides Product",
    "N-able defines Terminology Standard",
    "N-able publishes Template",
    "N-able manages Partner",
    "N-able supports Partner",
    "N-able manages Distributor",
    "N-able owns AI Agent Framework"
  ],
  "prompt_examples": [
    "What monitoring tools does N-able provide for remote access?",
    "Does N-able have a default patching policy template?",
    "List all automation policies published by N-able."
  ],
  "agent_execution": {
    "interpretation": "When the term “N-able” is used in a prompt, the agent interprets it as a query against global or platform-wide definitions that originate from the N-able platform node. The agent resolves requests by:",
    "actions": [
      "Accessing the centralized N-able catalog of tools, templates, and product definitions",
      "Filtering results not tied to any specific tenant or MSP configuration",
      "Returning default (global) policies, tools, scripts, or documentation",
      "Providing N-able-wide metadata rather than tenant-specific data"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000291",
  "canonical_term": "Network",
  "definition": "A Network is a collection of interconnected devices, systems, and services that communicate using standard protocols. In the DevOps Infrastructure Ontology, it includes both physical infrastructure (e.g., routers, switches, cabling) and logical constructs (e.g., IP subnets, VLANs, virtual networks). In the MSP and N-able context, networks are monitored for availability, performance, security, and connectivity, often segmented by customer, site, or service.",
  "synonyms": [
    "LAN / WAN (context-specific — use when defining scope)",
    "Segment",
    "Subnet",
    "Virtual Network (when hosted in cloud environments)"
  ],
  "relationships": [
    "Network connects Device or Service",
    "Network isMonitoredBy Agent or NMS (Network Monitoring System)",
    "Network contains IPAddressRange",
    "Network isSecuredBy Firewall or AccessControlList",
    "Network isAssociatedWith Site or Tenant",
    "Network hasTopology including Nodes and Links"
  ],
  "prompt_examples": [
    "Check for latency issues in the network segment at the Dallas site.",
    "List all devices connected to the ‘Guest Wi-Fi’ network.",
    "Is the backup network isolated from production traffic in tenant ‘HealthBridge’?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Network,” the AI agent will:",
    "actions": [
      "Identify the relevant network(s) based on name, address range, or associated site/tenant",
      "Retrieve monitoring metrics (latency, packet loss, uptime, etc.)",
      "Determine what devices or services are connected to or dependent on the network",
      "Identify policy violations or anomalies (e.g., unauthorized access, unencrypted traffic)",
      "Trigger diagnostics, isolation, or notification workflows if thresholds are breached"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000301",
  "canonical_term": "Network Map",
  "definition": "A Network Map is a visual or structured representation of devices, endpoints, and interconnections within a networked environment. It provides topology awareness, showing how elements such as routers, switches, firewalls, servers, and workstations are linked—often including metadata like IP addresses, MAC addresses, status, and roles. Network maps support monitoring, diagnostics, capacity planning, and security audits.",
  "synonyms": [
    "Network Topology Map",
    "Device Map",
    "Infrastructure Map",
    "Logical Map",
    "Physical Map (context-specific)"
  ],
  "relationships": [
    "Network Map includes Device, Interface, and Connection",
    "Network Map isGeneratedBy Discovery or Monitoring Tool",
    "Network Map isUpdatedBy NetworkScan or Agent",
    "Network Map isViewedBy Technician or AI Agent",
    "Network Map mayInclude VLAN, Subnet, or WirelessSegment"
  ],
  "prompt_examples": [
    "Show the network map for the Dallas site with device health overlays.",
    "Highlight all unmanaged devices on the current network map.",
    "Regenerate the network map after onboarding new switches.",
    "Export the network map with IP and MAC address details for compliance reporting."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Network Map,” the AI agent will:",
    "actions": [
      "Retrieve or regenerate the latest topology data from discovery tools or agents",
      "Organize devices and connections into a logical or physical layout",
      "Overlay relevant metrics (e.g., status, alert state, bandwidth) if requested",
      "Identify gaps, unmanaged assets, or policy violations",
      "Present the map visually (if supported), or provide a structured summary as output"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000311",
  "canonical_term": "Notification",
  "definition": "A Notification is a message or alert generated by a system, policy, or agent to inform a user, technician, or administrator of an event, condition, or required action. Notifications may be triggered by monitoring thresholds, policy violations, automation results, or system events. They can be delivered through various channels such as email, SMS, in-app alerts, or PSA integrations.",
  "synonyms": [
    "Alert (when real-time or critical — use with care)",
    "Message (too broad — avoid unless contextualized)",
    "Prompt (in user-interface contexts)",
    "Signal (not typically used — avoid)"
  ],
  "relationships": [
    "Notification isTriggeredBy Event, Policy, or Agent",
    "Notification isDeliveredTo User, Group, or IntegrationEndpoint",
    "Notification describes Condition or Result",
    "Notification isPartOf AlertingPolicy or EscalationWorkflow",
    "Notification isLoggedIn NotificationHistory"
  ],
  "prompt_examples": [
    "Send a notification to the admin group when disk usage exceeds 90%.",
    "What notifications were generated during last night’s patching window?",
    "Suppress non-critical notifications for tenant ‘Acme Legal’ during maintenance."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Notification,” the AI agent will:",
    "actions": [
      "Identify the trigger context (event, threshold, policy action, etc.)",
      "Determine the appropriate recipients and delivery channel",
      "Format the message using configured templates or dynamic event data",
      "Deliver the message and log the notification event",
      "Optionally suppress, escalate, or bundle notifications based on configuration"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000321",
  "canonical_term": "OID",
  "definition": "OID (Object Identifier) is a globally unique identifier used in SNMP (Simple Network Management Protocol) to represent a specific piece of data that can be queried or monitored on a managed device. OIDs follow a hierarchical dotted-decimal notation (e.g., 1.3.6.1.2.1.1.3.0) and correspond to specific metrics or attributes such as uptime, CPU usage, or interface status. In MSP and IT environments, OIDs are essential for polling devices and triggering alerts based on performance or health data.",
  "synonyms": [
    "Object Identifier",
    "SNMP OID",
    "MIB Entry",
    "SNMP Metric",
    "OID Path"
  ],
  "relationships": [
    "OID isPartOf MIB (Management Information Base)",
    "OID isQueriedBy SNMP Tool or Agent",
    "OID represents Metric or Status",
    "OID isDefinedBy Vendor or Standard Body",
    "OID mayTrigger Alert or Threshold Violation"
  ],
  "prompt_examples": [
    "What is the OID for memory usage on Cisco routers?",
    "Poll OID 1.3.6.1.2.1.25.1.1.0 for system uptime on all SNMP-enabled devices.",
    "Map custom OIDs to human-readable labels in the monitoring dashboard.",
    "Set a threshold alert for the CPU load OID on VMware hosts."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “OID,” the AI agent will:",
    "actions": [
      "Look up the OID in the device's MIB or internal catalog",
      "Use SNMP to query the corresponding value from the target device",
      "Interpret the result based on expected data type (e.g., integer, string, gauge)",
      "Compare against thresholds if defined, and trigger alerts or actions",
      "Log the OID query, result, and any subsequent actions in the monitoring system"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000331",
  "canonical_term": "Organization",
  "definition": "This term should probably be avoided due to ambiguity. An Organization is a general-purpose container representing any structured business or entity within the N-able ecosystem. It may refer to a Distributor, MSP, Tenant, or even N-able itself, depending on context. “Organization” is primarily used in internal models, system hierarchies, or data structures to abstract the roles of different actors in the platform. In end-user contexts, the more specific terms (MSP, Tenant, etc.) are preferred.",
  "synonyms": [
    "Org (internal shorthand)",
    "Business Unit (when referring to internal structures)",
    "Entity (generic or API-level use)",
    "Account (ambiguous – avoid unless referring to billing)"
  ],
  "relationships": [
    "Organization mayBe N-able | Vendor | Distributor | MSP | Tenant",
    "Organization has SubOrganization",
    "Organization manages Users",
    "Organization owns Devices | Assets",
    "Organization applies Policy",
    "Organization has AccessLevel"
  ],
  "prompt_examples": [
    "Which organizations have more than 50 active scripts deployed?",
    "List all organizations managed by the distributor ‘TechBridge Global’.",
    "Does this organization have access to the advanced automation catalog?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Organization,” the agent interprets it as a flexible node in the hierarchy. It resolves the entity’s role based on its metadata:",
    "actions": [
      "If it’s at the top of the hierarchy with publishing rights → N-able",
      "If it resells to others → Distributor",
      "If it delivers services → MSP",
      "If it receives services → Tenant"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000332",
  "canonical_term": "Package",
  "definition": "A Package is a discrete unit of software that can be installed, upgraded, or removed on a device or system. It typically contains executable code, configuration files, and metadata needed to deploy software. Packages are distributed through package managers (e.g., MSI, RPM, DEB, EXE) and may represent full applications, libraries, agents, or drivers. In MSP environments, packages are often deployed via scripts, automation workflows, or remote management tools.\n\nCode which is an update may also be referred to as a Patch.",
  "synonyms": [
    "Installer",
    "Module (when part of a larger software system)",
    "Software Package",
    "Patch (when part of an explicit update to deployed software)",
    "Deployment Artifact"
  ],
  "relationships": [
    "Package installs Software",
    "Package isDeployedTo Device",
    "Package isManagedBy Script or Automation Policy",
    "Package hasVersion",
    "Package isSignedBy Vendor",
    "Package isHostedIn Repository"
  ],
  "prompt_examples": [
    "Install the package for Microsoft Edge on all Windows 11 devices.",
    "Which packages are waiting to be deployed on the ‘Sales-Laptops’ site?",
    "Has the antivirus agent package been successfully installed on device ‘HR-LT-002’?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Package,” the AI agent will:",
    "actions": [
      "Look up package metadata, including name, version, and vendor signature",
      "Validate compatibility with the target device (e.g., OS, architecture)",
      "Trigger installation, upgrade, rollback, or removal actions",
      "Log the outcome and update inventory or compliance records"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000333",
  "canonical_term": "Patch",
  "definition": "A Patch is a specific update package intended to correct known issues, fix vulnerabilities, or improve functionality in existing software. Patches may be distributed by vendors as part of regular update cycles (e.g., Microsoft Patch Tuesday), or released ad hoc in response to critical security flaws. In the MSP context, patches are applied across multiple tenants, devices, or sites using automation policies, schedules, or manual triggers.",
  "synonyms": [
    "Update (use only when not referring to feature upgrades)",
    "Hotfix",
    "Security Fix",
    "Software Update"
  ],
  "relationships": [
    "Patch isAppliedTo Device or Software",
    "Patch isPublishedBy Vendor",
    "Patch isPartOf UpdatePolicy",
    "Patch isMonitoredBy ComplianceEngine",
    "Patch hasSeverity Level",
    "Patch isScheduledBy AutomationPolicy"
  ],
  "prompt_examples": [
    "Apply all high-severity patches to servers in the ‘Finance’ tenant before Friday.",
    "What patches failed to install on the devices at the Boston site?",
    "Generate a report of missing security patches for all Windows 11 laptops.",
    "Patch the application Foo immediately for tenant Jonson & Jonson"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Patch,” the AI agent will:",
    "actions": [
      "Identify the relevant patch based on vendor, product, severity, or classification",
      "Determine installation status on applicable devices",
      "Schedule or trigger patch installation (immediate, deferred, or staged)",
      "Log results, including success/failure per device, and update compliance reports",
      "If applicable, check for required reboots or follow-up tasks"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000334",
  "canonical_term": "Performance",
  "definition": "Performance refers to the operational efficiency and responsiveness of a system, device, or application. It is typically measured through metrics such as CPU usage, memory consumption, disk I/O, network throughput, and latency. In the MSP and N-able context, performance is used to assess the health of devices, detect bottlenecks, and determine whether systems are operating within acceptable thresholds.",
  "synonyms": [
    "System Health (ambiguous – use when referring to overall status)",
    "Responsiveness (context-specific – use when referring to end-user experience)",
    "Efficiency (too vague – avoid in prompts)"
  ],
  "relationships": [
    "Performance isMeasuredBy Metric",
    "Performance affects UserExperience",
    "Performance isMonitoredBy Agent or MonitoringPolicy",
    "Performance isReportedIn Dashboard or Report",
    "Performance triggers Alert or Automation"
  ],
  "prompt_examples": [
    "Check the performance of device ‘ENG-LT-05’ and flag any CPU or memory spikes.",
    "Generate a performance report for all servers in the ‘West Coast’ site over the last 7 days.",
    "What performance metrics are being tracked for the tenant ‘SecureNet’?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Performance,” the AI agent will:",
    "actions": [
      "Retrieve relevant metrics such as CPU load, memory usage, disk activity, and network traffic",
      "Evaluate current values against historical baselines and configured thresholds",
      "Detect anomalies or degradation (e.g., sustained high CPU, low available RAM)",
      "Recommend or trigger remediation actions (e.g., restart service, notify admin, scale resources)",
      "Optionally summarize trends in reports or dashboards"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000335",
  "canonical_term": "Port",
  "definition": "A Port is a logical or physical interface used for communication between devices or applications. In networking, a port refers to a numbered endpoint in the transport layer (TCP/UDP) that identifies specific processes or services on a device (e.g., port 22 for SSH, port 443 for HTTPS). In hardware, a port can also refer to a physical connection point on a switch, router, or server. In MSP and IT environments, ports are monitored, managed, and filtered for performance, availability, and security.",
  "synonyms": [
    "Network Port (logical)",
    "TCP/UDP Port",
    "Switch Port (physical)",
    "Interface (context-specific)",
    "Service Port"
  ],
  "relationships": [
    "Port isUsedBy Service, Protocol, or Application",
    "Port isOpenedOn Device, Firewall, or OS",
    "Port isMonitoredFor Status, Traffic, or Security Risk",
    "Port isBlockedBy Firewall or Policy",
    "Port isMappedTo Internal Resource or Endpoint"
  ],
  "prompt_examples": [
    "List all open TCP ports on the Windows server in the lab subnet.",
    "Alert if port 3389 is accessible from external networks.",
    "Disable unused switch ports for security hardening.",
    "Which ports are used by the remote monitoring agent?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Port,” the AI agent will:",
    "actions": [
      "Determine whether the request refers to a logical network port or physical hardware port",
      "Scan, query, or retrieve configuration and status for the specified port",
      "Evaluate port activity against policies, known vulnerabilities, or usage patterns",
      "Trigger alerts or remediations for suspicious or unauthorized port usage",
      "Log port-related actions, including scans, changes, or access attempts"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000336",
  "canonical_term": "Product",
  "definition": "A Product is a tangible or intangible item offered by a vendor, encompassing software applications, hardware devices, or services. In the DevOps Infrastructure Ontology, a product is an entity that can be deployed, configured, and managed within an IT environment. Products are often associated with specific versions, configurations, and may be part of a larger service offering.",
  "synonyms": [
    "Offering",
    "Solution",
    "Application (when referring to software products)",
    "Service (in the context of service products)"
  ],
  "relationships": [
    "Product isProvidedBy Vendor",
    "Product hasVersion Version",
    "Product isDeployedOn Device or Infrastructure",
    "Product isConfiguredBy Configuration",
    "Product isPartOf ServiceOffering",
    "Product hasDependency on other Products"
  ],
  "prompt_examples": [
    "List all products deployed in the ‘Healthcare’ tenant.",
    "Check the current version of the antivirus product on all endpoints.",
    "Identify any products with known vulnerabilities in the ‘Finance’ department."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Product,” the AI agent will:",
    "actions": [
      "Identify the specific product(s) based on name, version, or associated vendor.",
      "Retrieve deployment and configuration details across the infrastructure.",
      "Assess compliance with organizational policies and identify any discrepancies.",
      "Provide recommendations for updates, patches, or reconfigurations as needed."
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000337",
  "canonical_term": "Remote Browser",
  "definition": "A Remote Browser is a virtualized or cloud-hosted web browser session that runs on a remote server rather than the local device. It allows users to interact with web content securely without exposing their endpoint or internal network. In MSP and security-focused environments, remote browsers are used for isolating risky web activity, protecting against zero-day threats, and enforcing browsing policies without compromising the local system.",
  "synonyms": [
    "Remote Browser Session",
    "Isolated Browser",
    "Cloud Browser",
    "Browser Isolation",
    "Virtual Browser"
  ],
  "relationships": [
    "Remote Browser isHostedOn Remote Server or Virtual Machine",
    "Remote Browser isAccessedBy User, Technician, or Agent",
    "Remote Browser isUsedFor Secure Browsing or Isolation",
    "Remote Browser isManagedBy Policy or Security Platform",
    "Remote Browser mayBeLoggedIn Audit Log or Session History"
  ],
  "prompt_examples": [
    "Launch a remote browser session to safely inspect the suspicious URL.",
    "Restrict remote browser use to technicians only during incident investigations.",
    "Log all activity performed via the remote browser in the audit trail.",
    "Which clients have remote browser isolation enabled as part of their security policy?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Remote Browser,” the AI agent will:",
    "actions": [
      "Initiate or locate a cloud-hosted browser session based on the user's role and policy",
      "Route the requested URL through the remote browser and relay the visual interface to the user",
      "Enforce any content filtering, domain restrictions, or recording requirements",
      "Monitor session activity and store logs for audit or compliance",
      "Terminate or isolate the session automatically based on timeout, policy, or threat detection"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000338",
  "canonical_term": "Report",
  "definition": "A Report is a structured output that presents data collected from systems, policies, or agents over a defined time period. Reports are used for analysis, auditing, compliance, customer communication, or internal performance tracking. In the MSP and N-able context, reports may include information on device health, backup status, patch compliance, license usage, or automation outcomes. Reports can be generated on demand or scheduled, and may be exported in formats such as PDF, CSV, or JSON.",
  "synonyms": [
    "Summary",
    "Export",
    "Dashboard"
  ],
  "relationships": [
    "Report summarizes Data or Metrics",
    "Report isGeneratedBy Product, Agent, or MonitoringTool",
    "Report isDeliveredTo User, MSP, or Tenant",
    "Report isFilteredBy TimeRange, Entity, or Policy",
    "Report isConfiguredIn ReportingPolicy or Schedule"
  ],
  "prompt_examples": [
    "Generate a weekly patch compliance report for tenant ‘SecureTech’.",
    "What reports are available for backup status over the past 30 days?",
    "Email the executive summary report to all distributors by Monday."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Report,” the AI agent will:",
    "actions": [
      "Retrieve relevant data sources based on the requested topic and filters",
      "Aggregate, format, and organize the information into the specified report type",
      "Apply branding, formatting, and delivery settings (if configured)",
      "Export the report to a file or deliver it through email, UI, or third-party systems",
      "Log the report generation and delivery for traceability"
    ]
  },
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000339",
  "canonical_term": "Resource",
  "definition": "A Resource is a general term that refers to any manageable object within the N-able ecosystem. This includes physical or virtual components such as devices, users, software, network elements, storage, and compute instances. In internal models (and in the DevOps Infrastructure Ontology), “Resource” is often used as an abstract class or grouping term for things that can be monitored, configured, automated, or queried. It is not recommended for use in AI prompts due to its vagueness.",
  "synonyms": [
    "Asset",
    "Object",
    "Entity"
  ],
  "relationships": [
    "Resource mayBe a Device, Server, User, Process, Script, or NetworkComponent",
    "Resource has Status",
    "Resource isManagedBy Agent",
    "Resource belongsTo Site or Tenant",
    "Resource isTaggedWith Label or Category"
  ],
  "prompt_examples": [
    "INCORRECT: “Check the health of all resources in the customer ‘Brightline’.”",
    "CORRECT: “Check the health of all devices in the customer ‘Brightline’.”",
    "INCORRECT: “What resources are consuming the most bandwidth?”",
    "CORRECT: “What devices or servers are consuming the most bandwidth?”"
  ],
  "agent_execution": {
    "interpretation": "When the term “Resource” is used, the agent:",
    "actions": [
      "Attempts to infer the intended object type based on context (e.g., device, server, user)",
      "Groups results across multiple types unless otherwise specified",
      "May return an ambiguous or overly broad result, reducing the usefulness of the output",
      "Logs a semantic warning if the target object class is unclear"
    ]
  },
  "recommendation": "Avoid using the term “Resource” in end-user prompts or agent-facing commands. Instead: Use Device, Server, Script, Policy, User, etc., to specify the object type. Reserve “Resource” for internal system modeling or development documentation where abstraction is required.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000340",
  "canonical_term": "Role",
  "definition": "A Role is a predefined set of permissions, responsibilities, or access rights assigned to a user, system, or agent within an IT or MSP environment. Roles are used to control access to systems, features, or data based on job function or context. They enable policy enforcement, least-privilege access, and streamlined onboarding by grouping permissions into reusable access profiles.",
  "synonyms": [
    "Access Role",
    "User Role",
    "Permission Group",
    "Access Profile",
    "Security Role"
  ],
  "relationships": [
    "Role isAssignedTo User, Agent, or API Client",
    "Role grantsAccessTo System, Feature, or Dataset",
    "Role isDefinedBy Access Policy or Admin",
    "Role isStoredIn Directory, Identity System, or RBAC Engine",
    "Role influences Credential Use and Audit Visibility"
  ],
  "prompt_examples": [
    "Assign the ‘Technician’ role to all new users in the MSP portal.",
    "What permissions are included in the ‘Backup Admin’ role?",
    "Revoke elevated roles from users inactive for more than 30 days.",
    "List all roles with access to credential management features."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Role,” the AI agent will:",
    "actions": [
      "Identify the role definition and its associated permissions",
      "Determine who or what currently holds the role",
      "Modify role assignments, if requested, while validating scope and security policies",
      "Audit role-related changes and flag violations of least-privilege principles",
      "Reference roles when determining what actions an agent or user is allowed to perform"
    ]
  },
  "recommendation": "Use Role when managing access control, permissions, or onboarding processes. For specific privileges, consider referencing the individual permission or function where appropriate.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000341",
  "canonical_term": "Router",
  "definition": "A Router is a network device that forwards data packets between computer networks, directing traffic based on destination IP addresses. Routers connect local networks (LANs) to external networks (such as the internet) and can also route traffic between VLANs or subnets. Routers are critical infrastructure components often managed remotely for monitoring, configuration, and policy enforcement.",
  "synonyms": [
    "Network Router",
    "Edge Router",
    "Gateway",
    "Routing Device",
    "WAN Router"
  ],
  "relationships": [
    "Router connects Network, Site, or Subnet",
    "Router isMonitoredBy Probe, Agent, or SNMP",
    "Router isConfiguredBy Technician or Automation",
    "Router mayGenerate Alert or LogEntry",
    "Router isTrackedIn Inventory or Network Map"
  ],
  "prompt_examples": [
    "Restart the router at the Denver branch after applying the firmware update.",
    "List all routers with SNMP polling enabled and CPU load over 80 percent.",
    "Add a static route to the guest VLAN on the main office router.",
    "Identify any routers that have not checked in during the last 24 hours."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Router,” the AI agent will:",
    "actions": [
      "Locate the router in the network inventory or topology map",
      "Retrieve configuration, performance, and health metrics",
      "Apply configuration changes, firmware updates, or routing rules as authorized",
      "Monitor connectivity and generate alerts for failures or anomalies",
      "Record all actions and configuration changes in the audit log"
    ]
  },
  "recommendation": "Use Router when referring to devices that control IP traffic flow between networks. For internal-only devices that operate at Layer 2, consider using Switch instead.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000342",
  "canonical_term": "Script",
  "definition": "A Script is a predefined, executable set of instructions used to automate actions on devices, services, or platforms. In the MSP context, scripts are widely used for tasks such as remediation, deployment, configuration, and monitoring. Scripts can be written in various languages (e.g., PowerShell, Bash, Python) and are executed manually, on a schedule, or as part of automation policies triggered by events or conditions.",
  "synonyms": [
    "Automation Script",
    "Command Script",
    "Routine",
    "Playbook"
  ],
  "relationships": [
    "Script isExecutedOn Device or CloudResource",
    "Script isTriggeredBy Event or Schedule",
    "Script isOwnedBy MSP or N-able",
    "Script isPartOf AutomationPolicy or Workflow",
    "Script produces OutputData or modifies Configuration"
  ],
  "prompt_examples": [
    "Run the disk cleanup script on all Windows servers in the ‘Finance’ tenant.",
    "List all scripts that have failed in the last 24 hours.",
    "Schedule the user offboarding script for every Friday at 6 PM."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Script,” the AI agent will:",
    "actions": [
      "Locate the script in the approved script repository or library",
      "Validate execution scope (target devices, permissions, timing)",
      "Trigger the script as requested (immediate, scheduled, or conditional)",
      "Monitor for success/failure, capture output, and log results",
      "Enforce execution limits or policy constraints (e.g., tenant isolation, script approval)"
    ]
  },
  "recommendation": "Use Script when referring to automatable, repeatable task logic. For accuracy: Specify script name, language, and execution scope. Indicate whether it’s a one-time action or part of a policy. Include execution timing or trigger conditions when relevant.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000343",
  "canonical_term": "Serial Number",
  "definition": "A Serial Number is a unique identifier assigned to a specific hardware or software asset by the manufacturer or vendor. It is used to distinguish one physical or virtual item from another for purposes such as inventory tracking, warranty management, licensing, and support. In MSP and IT environments, serial numbers are commonly used to manage devices like laptops, servers, network hardware, and backup appliances.",
  "synonyms": [
    "Hardware ID",
    "Device ID",
    "Product Serial",
    "Asset Tag",
    "S/N"
  ],
  "relationships": [
    "Serial Number identifies Device or Component",
    "Serial Number isCollectedBy Discovery, Agent, or ManualEntry",
    "Serial Number isStoredIn Inventory or CMDB",
    "Serial Number isUsedFor Warranty Check or Support Lookup",
    "Serial Number mayBeMappedTo Asset Record or Purchase Info"
  ],
  "prompt_examples": [
    "Retrieve the serial numbers of all Dell laptops at the Toronto office.",
    "Check if the serial number 9B2K3T1 is still under manufacturer warranty.",
    "Export a list of serial numbers for all backup appliances with errors this month.",
    "Which devices in the inventory are missing serial numbers?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Serial Number,” the AI agent will:",
    "actions": [
      "Search the inventory or asset database for matching serial numbers",
      "Validate the uniqueness and format of the serial number",
      "Retrieve related data such as device model, location, status, and warranty info",
      "Trigger workflows related to warranty validation, asset tracking, or vendor escalation",
      "Record actions involving serial number lookups or updates in the system log"
    ]
  },
  "recommendation": "Use Serial Number when referencing unique hardware or software identifiers for lifecycle management, compliance, or support. Always pair with context (e.g., device type or site) for clarity.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000353",
  "canonical_term": "Server",
  "definition": "A Server is a physical or virtual computing resource designed to provide services, applications, or data to other devices or clients. In the DevOps Infrastructure Ontology, a Server is a subclass of devopscore:Resource and is characterized by its role in hosting software components, managing workloads, and facilitating networked operations. Servers are integral to IT infrastructures, supporting various functions such as web hosting, database management, and application deployment.",
  "synonyms": [
    "Host",
    "Node",
    "Compute Instance",
    "VM",
    "Physical Server"
  ],
  "relationships": [
    "Server hosts SoftwareComponent",
    "Server hasHardwareComponent Hardware",
    "Server isLocatedIn DataCenter",
    "Server connectsTo Network",
    "Server dependsOn PowerSupply",
    "Server isManagedBy SystemAdministrator"
  ],
  "prompt_examples": [
    "List all servers hosting the ‘Customer Relationship Management’ application.",
    "What is the current CPU utilization of servers located in the ‘East Coast Data Center’?",
    "Deploy the latest security patch to all web servers running Apache HTTP Server."
  ],
  "agent_execution": {
    "interpretation": "When processing prompts involving “Server,” the AI agent will:",
    "actions": [
      "Query the infrastructure inventory to retrieve all entities classified under the Server category",
      "Apply filters such as location (isLocatedIn), hosted software (hosts), or hardware specifications (hasHardwareComponent) to narrow down the relevant servers",
      "Execute the requested operations, such as retrieving performance metrics, deploying software updates, or modifying configurations on the identified servers",
      "Verify that actions comply with organizational policies and log activities for auditing purposes"
    ]
  },
  "recommendation": "Use 'Server' when referring to devices responsible for delivering services, hosting applications, or running infrastructure workloads. Be specific with attributes like physical vs. virtual, location, and workload.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000354",
  "canonical_term": "Service",
  "definition": "A Service is a functional capability delivered through software, infrastructure, or human operations. In the DevOps Infrastructure Ontology, a service may be a system-level process (e.g., a daemon or microservice), a cloud-hosted API, or a business-facing offering (e.g., backup service, monitoring service). In the MSP context, services may be IT services provided to tenants (e.g., endpoint protection), or software-based services running on devices or in the cloud.",
  "synonyms": [
    "System Service",
    "Managed Service",
    "API Service",
    "Feature"
  ],
  "relationships": [
    "Service isHostedOn Device or Cloud",
    "Service isProvidedBy Product or Vendor",
    "Service isMonitoredBy Agent",
    "Service isPartOf ServiceOffering or SLA",
    "Service dependsOn Software or Configuration",
    "Service isConsumedBy User or Tenant"
  ],
  "prompt_examples": [
    "Check if the backup service is running on all servers in the ‘Legal’ tenant.",
    "List all services provided to the customer ‘BrightPath Health’.",
    "Which services are failing health checks in the ‘EU Data Center’?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Service,” the AI agent will:",
    "actions": [
      "Determine whether the service is a system-level process or a business-level offering",
      "Identify the devices, tenants, or environments associated with that service",
      "Query service status (running, failed, degraded, stopped)",
      "Correlate with configuration, dependencies, or SLA status",
      "Take remediation steps if authorized (e.g., restart, notify, escalate)"
    ]
  },
  "recommendation": "Use Service when referring to ongoing functional components — whether system-based (e.g., 'AV scan service') or offering-based (e.g., 'managed patching service'). Clarify the scope: running software or delivered offering. Include name, location, and context (e.g., product, tenant, device). Avoid overloading the term 'service' for unrelated tasks or generic support.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000355",
  "canonical_term": "Service Organization",
  "definition": "A Service Organization is a hierarchical container used within on-premises N-central deployments to group and manage multiple customer environments under a single Partner (MSP or IT Pro). It acts as an intermediary layer between the Partner and the Customer (Tenant) and allows for administrative separation, reporting, and delegation of services across logically distinct client accounts. Service Organizations are primarily used for internal structuring of accounts, enabling MSPs to manage multiple customers without cross-contamination of access or policy.",
  "synonyms": [
    "Sub-Customer",
    "Organization Unit",
    "Client Organization",
    "Department",
    "Branch"
  ],
  "relationships": [
    "Service Organization isManagedBy Partner",
    "Service Organization contains Customer (Tenant)",
    "Service Organization groups Devices, Policies, and Users",
    "Service Organization inherits or overrides Policies from Partner",
    "Service Organization isLoggedInTo by AssignedUser or Admin"
  ],
  "prompt_examples": [
    "List all service organizations under ‘CoreTech Systems’.",
    "Deploy the updated monitoring policy to all customers in the ‘Gov Services’ service organization.",
    "Which users have access to more than one service organization within ‘SecureOps MSP’?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt includes the term 'Service Organization,' the AI Agent will:",
    "actions": [
      "Resolve the organizational hierarchy: Partner → Service Organization → Customer",
      "Identify all objects (devices, users, policies) scoped to the Service Organization",
      "Apply or evaluate configuration or automation at the Service Org level",
      "Enforce boundary conditions (e.g., policy inheritance, user access isolation)",
      "Return filtered results or execute actions within the correct hierarchy node"
    ]
  },
  "recommendation": "Use Service Organization when referring to an internal logical grouping layer in N-central’s on-prem environments. Always specify: The owning MSP or IT Pro, whether you are targeting all customers within the org or a specific subset, and the scope of action (reporting, policy application, access control).",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000356",
  "canonical_term": "Site",
  "definition": "A Site is a physical or logical subdivision within a Tenant (Customer). It may represent a physical location (e.g., office, data center), a virtual group (e.g., cloud region, department), or any operational boundary used for organizing and managing Devices | Assets. Sites provide structure for automation, reporting, and policy scoping beneath the customer level.",
  "synonyms": [
    "Location",
    "Office",
    "Department",
    "Subtenant"
  ],
  "relationships": [
    "Site belongsTo Tenant",
    "Site contains Device | Asset",
    "Site has Policy",
    "Site mayContain Subsite"
  ],
  "prompt_examples": [
    "Check if the New York site for ‘Harbor Industries’ has any offline devices.",
    "Apply the new compliance policy to all sites in the customer ‘CityGov’.",
    "List software installed on devices in the Finance department site."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a 'Site,' the agent:",
    "actions": [
      "Resolves the site within the scope of the specified or inferred Tenant",
      "Filters Devices, Policies, and Scripts to those associated with the Site",
      "Applies actions (e.g., scans, updates, reports) only to entities within the Site boundary",
      "If no Site is specified, defaults to all Sites under the Tenant unless scoped otherwise"
    ]
  },
  "recommendation": "Use Site to refer to any scoped sub-entity within a Tenant for purposes of automation, monitoring, or policy enforcement. Clarify whether the Site is physical or logical when needed, and always link the Site back to its parent Tenant to avoid ambiguity.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000357",
  "canonical_term": "SNMP",
  "definition": "SNMP (Simple Network Management Protocol) is a widely used protocol for monitoring and managing devices on IP networks. It enables IT systems to collect data from network devices such as routers, switches, firewalls, servers, and printers. SNMP agents expose device metrics, statuses, and configurations, which can be queried or acted upon by monitoring tools. In MSP environments, SNMP is essential for device discovery, health checks, and alerting.",
  "synonyms": [
    "Simple Network Management Protocol",
    "SNMP Polling",
    "SNMP Trap",
    "Network Monitoring Protocol"
  ],
  "relationships": [
    "SNMP isEnabledOn Device or Interface",
    "SNMP isUsedBy Probe or Monitoring Tool",
    "SNMP exposes OID, Metric, or Status",
    "SNMP mayTrigger Alert or Script",
    "SNMP communicatesVia Port 161 (Polling) or 162 (Traps)"
  ],
  "prompt_examples": [
    "Poll all SNMP-enabled switches for current interface utilization.",
    "List devices that failed SNMP authentication in the last 24 hours.",
    "Trigger an alert when SNMP reports a fan failure on any core router.",
    "What is the OID for CPU usage on Fortinet firewalls using SNMP?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “SNMP,” the AI agent will:",
    "actions": [
      "Query SNMP-enabled devices using the appropriate OIDs and community strings",
      "Collect and interpret metrics such as uptime, bandwidth, temperature, or error rates",
      "Handle SNMP traps or unsolicited messages and route them to the alerting system",
      "Apply any configured thresholds or escalation rules for SNMP-derived data",
      "Record SNMP poll results and triggered actions in the monitoring system or audit log"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000358",
  "canonical_term": "Software",
  "definition": "Software refers to any executable program, application, or system component that performs functions on a computing platform. In the DevOps Infrastructure Ontology, Software is a subclass of devopscore:Resource and encompasses entities such as operating systems, applications, services, and scripts. Software can be installed on physical or virtual devices and is essential for enabling various IT operations and services.",
  "synonyms": [
    "Application",
    "Program",
    "Service",
    "Package"
  ],
  "relationships": [
    "Software isInstalledOn Device",
    "Software dependsOn other Software",
    "Software isManagedBy Agent",
    "Software canBe Patched",
    "Software hasVersion Version",
    "Software isConfiguredBy Configuration"
  ],
  "prompt_examples": [
    "List all software installed on device ‘ENG-LT-05’.",
    "Update the antivirus software to the latest version on all servers.",
    "Check if the CRM application is running on the New York site."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Software,” the AI agent will:",
    "actions": [
      "Identify the specific software entity based on name, version, or other attributes",
      "Determine the devices or environments where the software is installed",
      "Perform actions such as installation, update, configuration, or status checks",
      "Ensure that dependencies and configurations are managed appropriately"
    ]
  },
  "recommendation": "Use Software to refer specifically to executable programs or system components. When possible, specify the software name, version, and device or environment context.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
 {
  "id": "CAT-MIP-08072025-000000359",
  "canonical_term": "SSH",
  "definition": "SSH (Secure Shell) is a cryptographic network protocol used to securely access and manage remote systems over an unsecured network. SSH provides encrypted command-line access, secure file transfer, and tunneling capabilities. In MSP and IT environments, SSH is commonly used for remote administration of Linux servers, network devices, and virtual machines.",
  "synonyms": [
    "Secure Shell",
    "SSH Session",
    "Remote Shell",
    "Terminal Access",
    "Command-Line Login"
  ],
  "relationships": [
    "SSH connects Technician or Agent to Remote Device",
    "SSH isSecuredBy Public Key or Password Authentication",
    "SSH isUsedFor Script Execution, Troubleshooting, or Configuration",
    "SSH isLoggedIn Audit Log or Session History",
    "SSH mayBeRestrictedBy Firewall, Policy, or Role"
  ],
  "prompt_examples": [
    "Initiate an SSH session to the Ubuntu server for patch verification.",
    "List all devices with SSH enabled and open on port 22.",
    "Disable password-based SSH access and enforce key authentication.",
    "Record all SSH activity for compliance reporting."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “SSH,” the AI agent will:",
    "actions": [
      "Authenticate to the target system using configured credentials or key pairs",
      "Establish a secure terminal session for executing remote commands",
      "Optionally run predefined scripts or commands based on the task",
      "Capture session activity, output, and any resulting changes or errors",
      "Log the session details and actions taken for audit and security purposes"
    ]
  },
  "recommendation": "Use SSH for secure, encrypted remote access and management of devices, especially in Linux and network equipment contexts. Ensure appropriate authentication and logging are in place.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000360",
  "canonical_term": "Storage",
  "definition": "Storage refers to the physical or virtual infrastructure used to persist data, including backups, logs, software, configurations, and operating system files. In the MSP and N-able context, storage may include local disk drives, network-attached storage (NAS), cloud storage services (e.g., AWS S3), or specialized backup storage vaults. Storage is a critical resource that supports data retention, recovery, and compliance.",
  "synonyms": [
    "Storage Device",
    "Storage Vault",
    "Repository",
    "Volume"
  ],
  "relationships": [
    "Storage contains File, Backup, or Image",
    "Storage isAttachedTo Device or Site",
    "Storage isProvisionedBy CloudProvider or MSP",
    "Storage isMonitoredBy Agent or StoragePolicy",
    "Storage hasCapacity and UsageThreshold",
    "Storage isUsedBy Product or Service"
  ],
  "prompt_examples": [
    "How much storage is currently available in the backup vault for ‘Tenant-Alpha’?",
    "Alert me when storage usage exceeds 85% on any devices.",
    "List all cloud storage accounts used by the Cove backup service."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Storage,” the AI agent will:",
    "actions": [
      "Query current capacity, usage, and health metrics from telemetry or provider APIs",
      "Identify the storage type (local, NAS, SAN, cloud) and associated devices or services",
      "Apply configured policies for thresholds, scaling, or cleanup",
      "Trigger alerts, archive operations, or storage expansions if needed",
      "Track usage by tenant, device group, or product to ensure licensing and compliance alignment"
    ]
  },
  "recommendation": "Use Storage to refer specifically to physical or virtual data persistence infrastructure. Specify the storage type and context when possible to clarify intent.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000361",
  "canonical_term": "Syslog",
  "definition": "Syslog is a standard protocol used to capture and transmit log or event messages from network devices, servers, applications, or operating systems to a central log management system. Syslog messages include structured or semi-structured data that describe system events, warnings, errors, or informational messages. Syslog is commonly used to centralize logs for auditing, monitoring, security incident detection, and compliance.",
  "synonyms": [
    "System Log",
    "Event Log",
    "Logging Protocol",
    "Syslog Message"
  ],
  "relationships": [
    "Syslog isGeneratedBy Device, Application, or OperatingSystem",
    "Syslog isSentTo SyslogServer or SIEM",
    "Syslog contains Severity, Timestamp, and MessageContent",
    "Syslog isParsedBy LogAnalyzer or AI Agent",
    "Syslog mayTrigger Alert or Workflow"
  ],
  "prompt_examples": [
    "Show all syslog entries from firewalls in the last 12 hours.",
    "Filter syslog messages for SSH login failures on Linux servers.",
    "Forward all syslog messages to the SIEM platform and apply geo-IP tagging.",
    "What syslog events triggered critical alerts this week?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Syslog,” the AI agent will:",
    "actions": [
      "Access the syslog data store or forwarding pipeline",
      "Parse and normalize syslog messages for timestamp, source, facility, and severity",
      "Filter or correlate logs based on the prompt (e.g., keyword, device, severity)",
      "Surface relevant entries or summaries, and optionally initiate an action (e.g., alert, script execution, ticket creation)",
      "Record any action taken based on syslog analysis in an audit or incident log"
    ]
  },
  "recommendation": "Use Syslog to centralize, monitor, and analyze system and device log messages. Specify filtering criteria such as device, severity, or time range for targeted queries.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000362",
  "canonical_term": "Task",
  "definition": "A Task is an individual, executable unit of work within a larger Workflow. Tasks perform discrete actions such as running a script, checking system status, applying a patch, or sending a notification. In the DevOps Infrastructure Ontology, a task is an atomic operation that contributes to the overall goal of a workflow or automation policy. Tasks may be triggered manually, scheduled, or invoked automatically based on conditions.",
  "synonyms": [
    "Job",
    "Step",
    "Action",
    "Unit Operation"
  ],
  "relationships": [
    "Task isPartOf Workflow",
    "Task isExecutedBy Agent or Platform",
    "Task isExecutedBy Task Manager",
    "Task isTriggeredBy Event or Condition",
    "Task modifies or queries Resource",
    "Task hasResult Success, Failure, or Output",
    "Task mayDependOn PreviousTask"
  ],
  "prompt_examples": [
    "Create a task to restart all printers in the ‘Admin’ department every Sunday.",
    "Which tasks failed during last night’s patching workflow?",
    "Log the output of every task run as part of the onboarding process."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Task,” the AI agent will:",
    "actions": [
      "Identify the specific task definition, either standalone or as part of a workflow",
      "Validate prerequisites and execution context (permissions, scope, triggers)",
      "Execute the action associated with the task",
      "Capture results, return outputs, and handle exceptions if configured"
    ]
  },
  "recommendation": "Use Task to refer to discrete executable units within workflows or automation policies. Specify triggers, dependencies, and expected results for clarity.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000363",
  "canonical_term": "Telnet",
  "definition": "Telnet is a legacy network protocol used to provide text-based, remote command-line access to devices over TCP. Unlike SSH, Telnet does not encrypt the session, making it insecure for use over untrusted networks. In MSP and IT environments, Telnet may still be used for legacy systems, internal diagnostics, or device configuration, but it is generally replaced by more secure alternatives.",
  "synonyms": [
    "Telnet Session",
    "Remote Terminal",
    "Unencrypted CLI Access",
    "TCP Port 23 Access"
  ],
  "relationships": [
    "Telnet connects User or Script to Remote Device",
    "Telnet isEnabledOn Router, Switch, or Legacy System",
    "Telnet mayBeBlockedBy Firewall or Policy",
    "Telnet isUsedFor Configuration or Testing",
    "Telnet isReplacedBy SSH in Secure Environments"
  ],
  "prompt_examples": [
    "Test connectivity to port 25 using Telnet for SMTP troubleshooting.",
    "List all devices with Telnet services still enabled.",
    "Disable Telnet on all managed switches and enforce SSH-only access.",
    "Use Telnet to access the legacy PBX system for a configuration check."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Telnet,” the AI agent will:",
    "actions": [
      "Attempt to establish a session to the target IP and port using Telnet",
      "Execute diagnostic or configuration commands if access is successful",
      "Warn if Telnet is being used over insecure channels or in non-compliant environments",
      "Recommend or initiate migration to secure alternatives like SSH",
      "Log Telnet usage events for audit or deprecation planning"
    ]
  },
  "recommendation": "Use Telnet only for legacy systems or internal diagnostics where SSH is not available. Avoid Telnet for any external or untrusted network access.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000364",
  "canonical_term": "Template",
  "definition": "A Template is a reusable configuration object that defines a set of settings, rules, or characteristics to be applied to one or more assets, such as devices, scripts, users, or policies. Templates are commonly used to enforce consistency across environments and to streamline the deployment of standardized configurations. In N-able products, templates may be used for onboarding, automation, security settings, or monitoring configurations.",
  "synonyms": [
    "Profile",
    "Blueprint",
    "Configuration Template",
    "Policy Template"
  ],
  "relationships": [
    "Template appliesTo Device",
    "Template defines Settings",
    "Template isOwnedBy MSP or N-able",
    "Template mayBeAssignedTo Site or Tenant",
    "Template isBasedOn Policy or Script"
  ],
  "prompt_examples": [
    "Apply the Windows onboarding template to all new laptops at the Boston site.",
    "List all templates owned by the MSP ‘CoreNet Services’.",
    "Does the antivirus compliance template include real-time protection settings?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Template,” the AI agent will:",
    "actions": [
      "Retrieve the template definition, including its scope, settings, and owner",
      "Determine eligible targets (e.g., Devices, Sites, Tenants)",
      "Apply the settings defined in the template to those targets, unless overridden by policy exceptions",
      "Log any deviations or errors during application"
    ]
  },
  "recommendation": "Use Template to enforce standardized configurations and streamline deployments. Always specify scope and ownership to clarify application boundaries.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000365",
  "canonical_term": "Tenant",
  "definition": "A Customer is an organization or individual that receives IT services from an MSP. In technical terms, this is represented as a Tenant — a logically isolated environment within an MSP’s management system. Each Tenant contains its own devices, users, policies, and configuration, and does not have visibility into other tenants. “Customer” is the business-facing term; “Tenant” is the system-facing canonical term.",
  "synonyms": [
    "Customer",
    "Client",
    "End Customer",
    "Site"
  ],
  "relationships": [
    "Tenant isManagedBy MSP",
    "Tenant has Device",
    "Tenant has Sites",
    "Tenant has Policy",
    "Tenant isMonitoredBy Agent",
    "Tenant has SLA or ServiceAgreement",
    "Tenant belongsTo Distributor"
  ],
  "prompt_examples": [
    "Which customers haven’t checked in within the last 24 hours?",
    "Apply the new antivirus policy to all tenants in the finance sector.",
    "List all devices owned by the customer ‘Lighthouse Legal Group’."
  ],
  "agent_execution": {
    "interpretation": "When the prompt includes “Customer,” the agent maps this to a Tenant object in the system. It will:",
    "actions": [
      "Resolve the correct tenant based on name or ID",
      "Scope queries or actions to that tenant’s isolated environment",
      "Retrieve or apply policies, scripts, or configurations owned by the MSP",
      "Enforce data and action boundaries so one tenant cannot affect another"
    ]
  },
  "recommendation": "Use Tenant as the canonical term for isolated customer environments managed by MSPs. Use Customer or Client in business-facing contexts.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000366",
  "canonical_term": "Traffic",
  "definition": "Traffic refers to the flow of data packets transmitted across a network between devices, services, or endpoints. It includes both inbound and outbound communication and can represent various protocols (e.g., HTTP, DNS, SSH) and applications. In MSP and IT operations, monitoring traffic is essential for performance analysis, bandwidth management, anomaly detection, and security threat identification.",
  "synonyms": [
    "Network Traffic",
    "Data Flow",
    "Packet Stream",
    "Bandwidth Usage",
    "Throughput"
  ],
  "relationships": [
    "Traffic originatesFrom SourceDevice or Endpoint",
    "Traffic isSentTo DestinationDevice or ExternalService",
    "Traffic isMonitoredBy Firewall, NetworkProbe, or AI Agent",
    "Traffic mayBeClassifiedAs Normal or Suspicious",
    "Traffic influences Bandwidth, Latency, or QoS",
    "Traffic mayTrigger Alert or PolicyAction"
  ],
  "prompt_examples": [
    "Analyze outbound traffic from the finance VLAN over the past 24 hours.",
    "Block all traffic to known malicious IPs using the firewall policy.",
    "Summarize HTTP traffic patterns by device for the last 7 days.",
    "Detect unusual traffic spikes to external DNS servers."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Traffic,” the AI agent will:",
    "actions": [
      "Query network flow data, packet captures, or traffic logs from monitoring tools",
      "Aggregate or filter traffic by protocol, source, destination, port, or time window",
      "Detect anomalies or threshold violations such as unusual spikes or unauthorized destinations",
      "Correlate traffic patterns with known risks or baseline behaviors",
      "Trigger appropriate actions such as alerting, blocking, throttling, or logging based on configured policies"
    ]
  },
  "recommendation": "Use Traffic to refer to network data flows for monitoring and security. Specify protocol, source, destination, or time frame to refine queries and actions.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000367",
  "canonical_term": "User",
  "definition": "A User is an individual identity that interacts with or is managed by the ecosystem. The term User may refer to two distinct but related concepts. In the DevOps Infrastructure Ontology, a User is typically a human actor who interacts with resources and services, often through a UI, command line, or API. A user may represent different roles depending on the context, including an MSP administrator, IT technician, end user (someone logging into a managed device), or N-able support personnel. A user may also be a leaf node representing a person managed as part of a customer environment. Users can be associated with specific tenants, organizations, roles, or permissions, and their activities may be logged, audited, and constrained by policies. It is not recommended to use the term User without additional context.",
  "synonyms": [
    "Admin",
    "Technician",
    "End User",
    "Operator",
    "Identity"
  ],
  "relationships": [
    "User isAssignedTo Tenant, MSP, or Site",
    "User hasRole (e.g., Admin, Viewer, Operator, Support)",
    "User isAuthenticatedBy IdentityProvider or DirectoryService",
    "User performs Action or Task",
    "User accesses Product or Platform",
    "User isLoggedInVia Asset | Device or WebSession"
  ],
  "prompt_examples": [
    "List all users with admin access to tenant ‘BlueNet Solutions’.",
    "Has the end user ‘alex.jordan’ logged in from multiple locations recently?",
    "Disable the user account for ‘tech.msmith’ across all N-central-managed environments."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “User,” the AI Agent will:",
    "actions": [
      "Resolve the identity context (e.g., MSP admin, end user, support tech)",
      "Look up associated permissions, roles, tenant ownership, and login history",
      "Take actions such as listing access, modifying roles, disabling users, or flagging suspicious activity",
      "Use multi-tenant scoping rules to ensure actions are authorized and logged appropriately",
      "Disambiguate prompts like “user logged into the asset” vs. “user with N-able product access”"
    ]
  },
  "recommendation": "Use User with added context specifying role, scope, or identity type to avoid ambiguity.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000368",
  "canonical_term": "Version",
  "definition": "A Version is a specific state or release of a software application, configuration, operating system, firmware, or document that reflects its development or deployment stage. Versions are used to track changes, ensure compatibility, and manage updates across environments. In MSP and IT operations, versioning is critical for patching, compliance, supportability, and rollback planning.",
  "synonyms": [
    "Release",
    "Build",
    "Revision",
    "Software Version",
    "Firmware Version"
  ],
  "relationships": [
    "Version appliesTo Software, Device, OS, Policy, or Script",
    "Version isTrackedIn Inventory, Patch Manager, or CMDB",
    "Version isComparedTo RequiredVersion or LatestVersion",
    "Version mayTrigger Update, Alert, or Compatibility Check",
    "Version isReportedIn Device Summary or Compliance Report"
  ],
  "prompt_examples": [
    "List all devices running a version of Chrome older than 115.",
    "Is the backup agent version compatible with the current OS version?",
    "Update all endpoints to the latest version of the RMM agent.",
    "Which scripts have multiple versions saved in the automation library?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Version,” the AI agent will:",
    "actions": [
      "Identify the current version of the referenced object",
      "Compare it to known baselines, approved versions, or available updates",
      "Initiate version-specific actions such as patching, blocking, or rollback",
      "Surface compatibility warnings or compliance gaps when mismatched",
      "Log version changes, comparisons, and actions for auditing or reporting"
    ]
  },
  "recommendation": "Use Version to track and manage software or configuration states. Specify the object and version context to ensure accurate actions.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000369",
  "canonical_term": "VMware",
  "definition": "VMware is a widely used virtualization and cloud infrastructure platform that enables the creation, management, and operation of virtual machines (VMs) and virtualized environments. VMware products support server, desktop, and network virtualization, allowing multiple workloads to run on shared physical hardware. In MSP and IT environments, VMware is often integrated for infrastructure management, backup, monitoring, and automation.",
  "synonyms": [
    "VMware Platform",
    "ESXi Host",
    "vSphere Environment",
    "Virtualization Stack",
    "VMware Infrastructure"
  ],
  "relationships": [
    "VMware hosts Virtual Machine",
    "VMware isManagedBy vCenter or API",
    "VMware isMonitoredBy Agent, Probe, or SNMP",
    "VMware integratesWith Backup, Discovery, and Patch Tools",
    "VMware exposes Metrics, Inventory, and ConfigurationData"
  ],
  "prompt_examples": [
    "List all VMware hosts with over 80 percent CPU usage.",
    "Backup all virtual machines in the VMware cluster nightly.",
    "Which VMware guest VMs are running outdated tools?",
    "Add the new ESXi host to the existing VMware inventory group."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “VMware,” the AI agent will:",
    "actions": [
      "Connect to the VMware environment via vSphere API or integration endpoint",
      "Retrieve inventory and configuration data on hosts, VMs, and resource usage",
      "Monitor performance metrics and status indicators for virtualization health",
      "Execute tasks such as backup, VM tagging, or automated provisioning",
      "Log interactions and changes for audit and compliance reporting"
    ]
  },
  "recommendation": "Use VMware to refer specifically to virtualization infrastructure and management. Specify hosts, VMs, or clusters for detailed queries and actions.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000370",
  "canonical_term": "Vulnerability",
  "definition": "A Vulnerability is a weakness or flaw in software, hardware, or configuration that could be exploited to compromise system security, data integrity, or availability. Vulnerabilities are typically assigned a unique identifier (e.g., CVE ID), a severity score (e.g., CVSS), and may be associated with known exploits. In the MSP context, vulnerabilities are detected through scans, threat intelligence feeds, or vendor advisories and are often tracked and mitigated using patching, configuration changes, or compensating controls.",
  "synonyms": [
    "CVE",
    "Security Flaw",
    "Exploit",
    "Weakness"
  ],
  "relationships": [
    "Vulnerability affects Software or Device",
    "Vulnerability isIdentifiedBy VulnerabilityScanner or ThreatFeed",
    "Vulnerability hasSeverity Score",
    "Vulnerability isRemediatedBy Patch or ConfigurationChange"
  ],
  "prompt_examples": [
    "List all critical vulnerabilities detected on devices in the ‘Healthcare West’ tenant.",
    "Has the CVE-2024-23978 vulnerability been patched across all cloud servers?",
    "Generate a vulnerability report for third-party software used in finance-related sites."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Vulnerability,” the AI agent will:",
    "actions": [
      "Look up the vulnerability using known identifiers or descriptive keywords",
      "Query vulnerability scan results or correlated security event data",
      "Map the vulnerability to affected software, devices, or configurations",
      "Check remediation status: patched, mitigated, or unaddressed",
      "Recommend or trigger remediation actions if authorized"
    ]
  },
  "recommendation": "Use Vulnerability to identify and track security weaknesses. Specify identifiers or context for precise detection and remediation.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000371",
  "canonical_term": "Warranty",
  "definition": "A Warranty refers to the contractual period during which a hardware asset (e.g., server, laptop, disk) is covered for repairs, replacements, or support by the manufacturer or vendor. In the MSP context, warranty information helps inform lifecycle management, asset planning, and service prioritization. Tracking warranty status enables technicians to escalate hardware issues appropriately and manage risk around unsupported devices.",
  "synonyms": [
    "Hardware Coverage",
    "Support Agreement",
    "Manufacturer Service Contract"
  ],
  "relationships": [
    "Warranty isAssociatedWith Hardware or Device",
    "Warranty has StartDate and EndDate",
    "Warranty isProvidedBy Vendor or Manufacturer",
    "Warranty affects ReplacementPlan or LifecycleStage",
    "Warranty isTrackedIn AssetInventory"
  ],
  "prompt_examples": [
    "Which devices have warranties expiring in the next 30 days?",
    "Is the disk in device ‘HR-LT-004’ still under warranty?",
    "List all out-of-warranty servers in the ‘EMEA’ region."
  ],
  "agent_execution": {
    "interpretation": "When a prompt includes “Warranty,” the AI agent will:",
    "actions": [
      "Look up asset metadata to determine the warranty start and end dates",
      "Flag any expired or soon-to-expire warranties",
      "Associate warranty status with asset age, performance issues, or incident trends",
      "Suggest replacement recommendations or notify stakeholders based on policy",
      "Optionally pull warranty verification from vendor portals if integrated"
    ]
  },
  "recommendation": "Use Warranty to track support coverage periods for hardware assets. Specify asset and timeframe for accurate status and planning.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000372",
  "canonical_term": "Webhook",
  "definition": "A Webhook is a user-defined HTTP callback that automatically sends real-time data or event notifications from one system to another when a specified condition is met. Unlike APIs that require polling, webhooks push information immediately to an external endpoint. In MSP and IT environments, webhooks are often used to trigger workflows, sync systems, log events, or alert technicians based on changes in tickets, devices, backups, or policies.",
  "synonyms": [
    "HTTP Callback",
    "Event Hook",
    "Outbound Webhook",
    "Notification Endpoint",
    "Real-Time Trigger"
  ],
  "relationships": [
    "Webhook isTriggeredBy Event or StateChange",
    "Webhook sendsDataTo External System or Agent",
    "Webhook isConfiguredIn Platform, Policy, or Integration",
    "Webhook mayContain Payload with JSON or XML Format",
    "Webhook isLoggedIn Audit Log or Integration History"
  ],
  "prompt_examples": [
    "Create a webhook to notify the external ticketing system when a device goes offline.",
    "List all active webhooks configured for backup failure events.",
    "Disable the webhook that posts alerts to the incident response Slack channel.",
    "What payload does the policy webhook send when a patch job completes?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Webhook,” the AI agent will:",
    "actions": [
      "Retrieve the webhook configuration, including trigger event, URL, and payload format",
      "Monitor for relevant events and evaluate webhook triggering conditions",
      "Send structured data to the designated external endpoint",
      "Handle success or failure responses and retry logic if applicable",
      "Log webhook activity, errors, and payload content for audit and troubleshooting"
    ]
  },
  "recommendation": "Use Webhook to enable real-time event-driven integrations. Clearly define triggers, targets, and payload formats for reliable operation.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000373",
  "canonical_term": "WMI",
  "definition": "WMI (Windows Management Instrumentation) is a Microsoft technology that provides a standardized interface for accessing and managing data about Windows-based systems. It allows scripts, agents, and monitoring tools to query system information such as hardware status, software inventory, services, processes, and configuration settings. In MSP environments, WMI is widely used for device discovery, performance monitoring, remote execution, and automation.",
  "synonyms": [
    "Windows Management Instrumentation",
    "WMI Query",
    "WMI Provider",
    "WMI Service"
  ],
  "relationships": [
    "WMI isEnabledOn Windows Device",
    "WMI isQueriedBy Agent, Script, or Monitoring Tool",
    "WMI exposes SystemInfo, Metrics, or ConfigurationData",
    "WMI mayBeUsedIn Discovery, Alerting, or Reporting",
    "WMI isSecuredBy User Permissions and Firewall Rules"
  ],
  "prompt_examples": [
    "Query WMI for disk health and available storage on all domain-joined devices.",
    "Which devices have WMI disabled or returning errors?",
    "Use WMI to collect a list of installed applications across the fleet.",
    "Alert if WMI reports CPU usage over 90 percent for 10 minutes."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “WMI,” the AI agent will:",
    "actions": [
      "Establish a connection to the target Windows device using proper credentials and network access",
      "Execute the WMI query to retrieve requested information",
      "Parse and format results for reporting, monitoring, or policy evaluation",
      "Log WMI query outcomes, including failures or access issues",
      "Respect configured permissions, throttling rules, and audit requirements for WMI usage"
    ]
  },
  "recommendation": "Use WMI for Windows system management, ensuring proper permissions and network access are configured.",
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
,
{
  "id": "CAT-MIP-08072025-000000374",
  "canonical_term": "Workflow",
  "definition": "A Workflow is a structured sequence of tasks or activities designed to accomplish a specific objective within a system or process. In the DevOps Infrastructure Ontology, a workflow represents the orchestration of actions, often automated, that manage and control various aspects of IT infrastructure and software development. Workflows are essential for ensuring consistency, efficiency, and repeatability in operations.",
  "synonyms": [
    "Process Flow",
    "Automation Sequence",
    "Task Pipeline",
    "Operational Procedure"
  ],
  "relationships": [
    "Workflow consistsOf Actions or Tasks",
    "Workflow isTriggeredBy Event or Condition",
    "Workflow isManagedBy OrchestrationTool or AutomationPlatform",
    "Workflow interactsWith Resources such as Devices, Services, or Applications",
    "Workflow hasOutcome Result or StateChange"
  ],
  "prompt_examples": [
    "Initiate the onboarding workflow for a new employee in the ‘Sales’ department.",
    "What workflows are currently active for patch management across all servers?",
    "Modify the backup workflow to include encryption before data transfer."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Workflow,” the AI agent will:",
    "actions": [
      "Identify the specific workflow based on context and naming conventions.",
      "Execute the defined sequence of tasks, ensuring each step is completed successfully.",
      "Monitor the workflow’s progress and handle exceptions or errors as defined.",
      "Log the execution details for auditing and compliance purposes.",
      "Provide feedback or notifications upon completion or if intervention is required."
    ]
  },
  "recommendation": "Use Workflow to automate structured sequences of IT tasks. Clearly define triggers, steps, and outcomes for reliability.",
  "metadata": {
    "author": "Nicole Reineke",
    "source_url": "",
    "version": "1.0", 
    "date_added": "2025-08-07T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000012",
  "canonical_term": "Active User",
  "definition": "An Active User is a user account that has recently authenticated, initiated a session, performed actions, or otherwise engaged with a system, service, or platform within a defined timeframe. The term is used to distinguish between currently engaged or recently engaged users and those that are inactive, suspended, or dormant. In MSP and IT environments, active users are tracked for licensing, security auditing, capacity planning, and automation targeting.",
  "synonyms": [
    "Logged-In User",
    "Authenticated User",
    "Current User",
    "Engaged User",
    "Active Account"
  ],
  "relationships": [
    "Active User isAuthenticatedBy Directory or Identity Provider",
    "Active User interactsWith Application, Service, or Device",
    "Active User isTrackedIn Session Log, Audit Log, or Usage Report",
    "Active User mayBeAssignedTo Role, Policy, or License",
    "Active User contributesTo Usage Metrics or Billing"
  ],
  "prompt_examples": [
    "List all active users across all client tenants in the past 7 days.",
    "Trigger a password reset workflow for all active users with elevated privileges.",
    "Which active users accessed the backup management console yesterday?",
    "Export a report of all active users by site and department."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Active User,” the AI agent will:",
    "actions": [
      "Query the user directory, session logs, or activity metrics to identify accounts meeting the active criteria",
      "Apply filters such as time range, role, location, or group",
      "Correlate activity with licensing, authentication, or policy enforcement data",
      "Return the list of matching users or perform the requested action on their behalf",
      "Log all queries and actions for auditing or compliance purposes"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000021",
  "canonical_term": "ARR",
  "definition": "ARR (Annual Recurring Revenue) is the total value of recurring revenue from subscriptions or service contracts normalized over a one-year period. It represents the predictable income that an MSP or SaaS business expects to receive annually from active customers. ARR is a key metric for evaluating long-term growth, customer retention, and business valuation.",
  "synonyms": [
    "Annual Revenue",
    "Recurring Annual Revenue",
    "Subscription ARR",
    "Contracted Revenue (annualized)"
  ],
  "relationships": [
    "ARR isDerivedFrom MRR, multipliedBy 12",
    "ARR isTiedTo Subscriber, Contract, or Service Plan",
    "ARR isTrackedIn Financial System or CRM",
    "ARR isImpactedBy Renewals, Upgrades, or Churn",
    "ARR isReportedIn KPIs or Growth Dashboards"
  ],
  "prompt_examples": [
    "What is the current ARR across all managed security services?",
    "Compare ARR by client tier and contract length.",
    "How has ARR changed year-over-year for the healthcare vertical?",
    "Generate an ARR forecast based on current MRR and pipeline data."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “ARR,” the AI agent will:",
    "actions": [
      "Retrieve MRR and related subscription data to calculate ARR",
      "Segment ARR by service, customer, or region if specified",
      "Identify factors influencing ARR growth or decline, such as churn or expansion",
      "Generate reports, dashboards, or financial summaries for strategic planning",
      "Log ARR calculations and forecasting activities for auditing or executive review"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000031",
  "canonical_term": "Browser",
  "definition": "A Browser is a client application used to access and interact with content and services on the World Wide Web. It renders web pages, processes scripts, and facilitates communication with remote servers using protocols such as HTTPS. In MSP and IT environments, browsers are used to access web-based portals, dashboards, APIs, and SaaS platforms. They may also be managed through policies for security, compliance, and performance.",
  "synonyms": [
    "Web Browser",
    "Internet Browser",
    "Client Browser",
    "GUI Browser",
    "Desktop Browser"
  ],
  "relationships": [
    "Browser accesses Web Page, Portal, or API",
    "Browser runs on Endpoint, Workstation, or Virtual Desktop",
    "Browser isControlledBy Policy, Extension, or Configuration",
    "Browser isMonitoredFor Usage, Version, or Threats",
    "Browser mayBeIsolatedBy Remote Browser or Sandbox"
  ],
  "prompt_examples": [
    "Ensure all browsers in the environment are running the latest secure version.",
    "Restrict browser access to approved domains only for student users.",
    "Report which browsers are used most frequently across all managed endpoints.",
    "Deploy the web security extension to all Chrome browsers."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Browser,” the AI agent will:",
    "actions": [
      "Identify installed browser applications on the target endpoint or environment",
      "Retrieve version, configuration, and extension data for compliance and security",
      "Apply browser-related policies or updates as needed",
      "Monitor for unsafe browsing activity, outdated versions, or non-compliant settings",
      "Log browser-related actions or events for auditing and reporting"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000041",
  "canonical_term": "Incident",
  "definition": "An Incident is an unplanned event or disruption that affects the normal operation of a service, system, or asset and requires investigation, response, or resolution. Incidents can range from device failures and service outages to security breaches or policy violations. In MSP and IT environments, incidents are tracked through ticketing systems and are often subject to escalation paths, service-level agreements (SLAs), and post-resolution analysis.",
  "synonyms": [
    "Issue",
    "Disruption",
    "Event (context-specific)",
    "Outage",
    "Security Incident"
  ],
  "relationships": [
    "Incident isReportedBy User, Agent, or Monitoring Tool",
    "Incident isTrackedIn Ticketing System or Incident Queue",
    "Incident isAssignedTo Technician, Team, or AI Agent",
    "Incident isLinkedTo Alert, Asset, or Service",
    "Incident mayTrigger Workflow, Notification, or Escalation"
  ],
  "prompt_examples": [
    "List all open incidents affecting the backup infrastructure.",
    "Escalate critical incidents that remain unresolved after 2 hours.",
    "Which incidents were triggered by failed patch deployments?",
    "Generate a monthly report of all incidents by site and root cause."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to an “Incident,” the AI agent will:",
    "actions": [
      "Search the incident management system for relevant records based on status, severity, or source",
      "Retrieve and summarize incident details including timestamps, affected assets, and resolution steps",
      "Initiate workflows such as assignment, escalation, or notification based on defined rules",
      "Update the incident record with actions taken or insights generated",
      "Log all interactions and changes for auditing and service reporting"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000051",
  "canonical_term": "MRR",
  "definition": "MRR (Monthly Recurring Revenue) is the predictable, recurring portion of revenue generated from active subscriptions or service contracts on a monthly basis. It reflects the value of ongoing client relationships and is commonly used to track growth, retention, and financial health in MSP and SaaS business models.",
  "synonyms": [
    "Monthly Revenue",
    "Recurring Revenue",
    "Subscription Revenue",
    "Contracted Monthly Revenue"
  ],
  "relationships": [
    "MRR isGeneratedBy Subscriber or Customer",
    "MRR isTiedTo Service Plan, Contract, or License",
    "MRR isTrackedIn Billing System or CRM",
    "MRR isAffectedBy Upgrades, Cancellations, or Discounts",
    "MRR isReportedIn Financial Dashboards or KPIs"
  ],
  "prompt_examples": [
    "What is the total MRR for managed backup services this month?",
    "List all clients contributing more than $1,000 in MRR.",
    "How did MRR change after the quarterly contract renewals?",
    "Break down MRR by service type and client tier."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “MRR,” the AI agent will:",
    "actions": [
      "Retrieve current and historical MRR data from billing or subscription systems",
      "Segment MRR by client, service, or plan for analysis or reporting",
      "Identify changes in MRR due to churn, expansion, or pricing adjustments",
      "Generate dashboards, alerts, or forecasts based on MRR trends",
      "Log financial metrics and reporting actions for auditing and business review"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000061",
  "canonical_term": "PII",
  "definition": "PII (Personally Identifiable Information) refers to any data that can be used to identify an individual, either on its own or when combined with other information. This includes names, email addresses, phone numbers, government IDs, financial data, and biometric records. In MSP and IT environments, PII must be handled with strict security and compliance controls to meet privacy regulations such as GDPR, HIPAA, or CCPA.",
  "synonyms": [
    "Personally Identifiable Information",
    "Personal Data",
    "Sensitive Information",
    "Identity Data",
    "Confidential Customer Info"
  ],
  "relationships": [
    "PII isStoredIn Database, CRM, or File System",
    "PII isProtectedBy Encryption, Access Control, or DLP Policy",
    "PII isSubjectTo Compliance Regulation or Data Policy",
    "PII mayBeAccessedBy User, Technician, or External System",
    "PII isMonitoredFor Breach, Misuse, or Unauthorized Access"
  ],
  "prompt_examples": [
    "Scan file shares for unencrypted PII such as SSNs and credit card numbers.",
    "Which backup sets contain customer PII subject to GDPR?",
    "Apply DLP policies to restrict email transmission of PII.",
    "Report all access to PII records in the past 30 days."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “PII,” the AI agent will:",
    "actions": [
      "Locate data sources likely to contain PII based on content types or metadata",
      "Identify and classify PII using pattern recognition, tags, or predefined rules",
      "Evaluate whether storage, access, and transmission comply with security and privacy policies",
      "Trigger alerts or remediation workflows in the event of unauthorized access or exposure",
      "Log all actions involving PII discovery, access, or handling for audit and compliance tracking"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000071",
  "canonical_term": "Policy",
  "definition": "A Policy is a defined set of rules or configurations that govern how systems, devices, users, or services should behave or be managed within an environment. Policies enforce standards related to security, compliance, automation, performance, and access. In MSP and IT operations, policies are applied to endpoints, users, or sites to ensure consistent behavior, streamline operations, and meet organizational or regulatory requirements.",
  "synonyms": [
    "Configuration Policy",
    "Management Policy",
    "Enforcement Rule",
    "System Policy",
    "Access Policy"
  ],
  "relationships": [
    "Policy isAppliedTo Device, User, Group, or Site",
    "Policy isCreatedBy Admin, Technician, or AI Agent",
    "Policy defines Rules, Settings, or Thresholds",
    "Policy isMonitoredFor Compliance or Violations",
    "Policy mayTrigger Alert, Action, or Workflow"
  ],
  "prompt_examples": [
    "Apply the antivirus policy to all unmanaged Windows devices.",
    "Which policies are currently assigned to the HR department endpoints?",
    "Create a new patching policy with a 72-hour compliance window.",
    "Alert if a device deviates from the baseline security policy."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Policy,” the AI agent will:",
    "actions": [
      "Retrieve the policy definition and scope, including affected objects and configuration details",
      "Validate the policy’s applicability to the specified targets",
      "Apply the policy settings or rules to the defined devices, users, or services",
      "Monitor for compliance and trigger alerts or remediation if deviations occur",
      "Log all policy applications, changes, and exceptions for auditing and reporting"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000081",
  "canonical_term": "Shadow IT",
  "definition": "Shadow IT refers to the use of software, hardware, cloud services, or other technology solutions within an organization without formal approval, visibility, or oversight from the IT department. This includes unmanaged SaaS tools, personal devices, and unauthorized data storage or sharing platforms. In MSP and IT environments, shadow IT poses risks related to security, compliance, data loss, and operational inefficiencies.",
  "synonyms": [
    "Unmanaged IT",
    "Rogue IT",
    "Unsanctioned Technology",
    "Unauthorized App Usage",
    "BYO Tools"
  ],
  "relationships": [
    "Shadow IT isUsedBy End User or Department",
    "Shadow IT bypasses IT Policy or Approval Workflow",
    "Shadow IT mayExpose PII or Sensitive Data",
    "Shadow IT isDetectedBy Monitoring Tool or AI Agent",
    "Shadow IT isReportedIn Risk Assessment or Compliance Audit"
  ],
  "prompt_examples": [
    "Identify all SaaS applications in use that are not approved by IT.",
    "Alert when new devices connect to the network without registration.",
    "Generate a report on potential shadow IT usage by department.",
    "What shadow IT risks were flagged during the last endpoint scan?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “Shadow IT,” the AI agent will:",
    "actions": [
      "Monitor network, device, and usage data to detect unauthorized tools or services",
      "Compare discovered assets against approved technology inventories or whitelists",
      "Classify shadow IT by risk level, user group, and type of service",
      "Trigger alerts, initiate risk remediation workflows, or generate compliance reports",
      "Log all detections and actions related to shadow IT for auditing and review"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000091",
  "canonical_term": "SSO",
  "definition": "SSO (Single Sign-On) is an authentication mechanism that allows users to access multiple systems or applications with a single set of login credentials. It streamlines user access while reducing password fatigue and improving security through centralized identity management. In MSP and IT environments, SSO is often integrated with identity providers (IdPs) such as Azure AD, Okta, or Google Workspace to control access across cloud and on-premises services.",
  "synonyms": [
    "Single Sign-On",
    "Federated Login",
    "Unified Login",
    "Centralized Authentication",
    "Identity Federation"
  ],
  "relationships": [
    "SSO isEnabledBy Identity Provider (IdP)",
    "SSO isUsedBy User or Technician",
    "SSO providesAccessTo Application, Portal, or Service",
    "SSO isGovernedBy Authentication Policy or Role",
    "SSO mayBeIntegratedWith MFA or Directory Service"
  ],
  "prompt_examples": [
    "Enable SSO for all technicians using Azure AD.",
    "List applications configured to support SSO for this client.",
    "Report failed SSO login attempts in the past 24 hours.",
    "Is SSO enforced for access to the backup management console?"
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to “SSO,” the AI agent will:",
    "actions": [
      "Retrieve SSO configuration details for the relevant identity provider and service",
      "Validate user identity and access permissions through the SSO process",
      "Log successful or failed login attempts for auditing and security monitoring",
      "Trigger conditional access workflows based on role, location, or device compliance",
      "Report on SSO usage, errors, and integration status across environments"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000101",
  "canonical_term": "Subscriber",
  "definition": "A Subscriber is an entity — typically a user, client, tenant, or system — that is actively enrolled in or assigned to a service, product, or data stream. Subscribers receive notifications, updates, access, or resources according to their subscription level or role. In MSP and IT environments, subscribers are often associated with licensing, usage metrics, automation triggers, or event-driven integrations.",
  "synonyms": [
    "Client",
    "Tenant",
    "Recipient",
    "Consumer",
    "Enrolled User"
  ],
  "relationships": [
    "Subscriber isAssignedTo Service, Plan, or Policy",
    "Subscriber isTrackedIn CRM, Directory, or Subscription System",
    "Subscriber mayReceive Notification, Report, or Update",
    "Subscriber mayBeBoundTo SLA, License, or Billing Agreement",
    "Subscriber interactsWith Portal, Agent, or API"
  ],
  "prompt_examples": [
    "List all active subscribers to the endpoint monitoring service.",
    "Send system health reports to all Gold-level subscribers.",
    "Which subscribers are over their cloud storage limit?",
    "Deactivate subscribers with expired licenses."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “Subscriber,” the AI agent will:",
    "actions": [
      "Identify the subscriber entity and retrieve associated metadata such as service tier, contact info, and usage status",
      "Determine eligibility or compliance based on policies, thresholds, or entitlements",
      "Perform requested actions such as notifications, provisioning, suspension, or escalation",
      "Update subscriber records and log activity for auditing or billing purposes"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
},
{
  "id": "CAT-MIP-08192025-000000111",
  "canonical_term": "User",
  "definition": "A User is an individual or system identity that interacts with IT services, applications, or infrastructure. Each user is typically associated with a unique account and may be assigned roles, permissions, policies, or resources. In MSP and IT environments, users are managed through identity systems, directory services, or RMM platforms to control access, monitor activity, and enforce security.",
  "synonyms": [
    "End User",
    "Account Holder",
    "Identity",
    "Login Account",
    "Operator"
  ],
  "relationships": [
    "User isAuthenticatedBy Identity Provider or Directory",
    "User isAssignedTo Role, Group, or Policy",
    "User interactsWith Device, Application, or Portal",
    "User isMonitoredFor Activity, Access, or Compliance",
    "User mayBeLinkedTo License, Ticket, or Alert"
  ],
  "prompt_examples": [
    "List all users with administrator privileges in the RMM platform.",
    "Deactivate users who have been inactive for more than 90 days.",
    "What devices are currently assigned to user jsmith@clientdomain.com?",
    "Apply MFA policy to all remote users in the finance department."
  ],
  "agent_execution": {
    "interpretation": "When a prompt refers to a “User,” the AI agent will:",
    "actions": [
      "Retrieve the user account and associated metadata from the relevant directory or system",
      "Determine the user’s roles, group memberships, permissions, and recent activity",
      "Perform actions such as enabling, disabling, updating, or notifying the user",
      "Enforce policies related to access, compliance, or security",
      "Log all user-related actions for audit, reporting, or troubleshooting"
    ]
  },
  "metadata": {
    "author": "Roop Petersen",
    "source_url": "",
    "version": "1.0",
    "date_added": "2025-08-19T00:00:00Z",
    "registry": "cat-mip.org",
    "term_type": ""
  }
}
]
